GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
LCDDATA6                                 equ 0116h
// bitfield definitions
LCDDATA6_SEG0_POSN                       equ 0000h
LCDDATA6_SEG0_POSITION                   equ 0000h
LCDDATA6_SEG0_SIZE                       equ 0001h
LCDDATA6_SEG0_LENGTH                     equ 0001h
LCDDATA6_SEG0_MASK                       equ 0001h
LCDDATA6_SEG1_POSN                       equ 0001h
LCDDATA6_SEG1_POSITION                   equ 0001h
LCDDATA6_SEG1_SIZE                       equ 0001h
LCDDATA6_SEG1_LENGTH                     equ 0001h
LCDDATA6_SEG1_MASK                       equ 0002h
LCDDATA6_SEG2_POSN                       equ 0002h
LCDDATA6_SEG2_POSITION                   equ 0002h
LCDDATA6_SEG2_SIZE                       equ 0001h
LCDDATA6_SEG2_LENGTH                     equ 0001h
LCDDATA6_SEG2_MASK                       equ 0004h
LCDDATA6_SEG3_POSN                       equ 0003h
LCDDATA6_SEG3_POSITION                   equ 0003h
LCDDATA6_SEG3_SIZE                       equ 0001h
LCDDATA6_SEG3_LENGTH                     equ 0001h
LCDDATA6_SEG3_MASK                       equ 0008h
LCDDATA6_SEG4_POSN                       equ 0004h
LCDDATA6_SEG4_POSITION                   equ 0004h
LCDDATA6_SEG4_SIZE                       equ 0001h
LCDDATA6_SEG4_LENGTH                     equ 0001h
LCDDATA6_SEG4_MASK                       equ 0010h
LCDDATA6_SEG5_POSN                       equ 0005h
LCDDATA6_SEG5_POSITION                   equ 0005h
LCDDATA6_SEG5_SIZE                       equ 0001h
LCDDATA6_SEG5_LENGTH                     equ 0001h
LCDDATA6_SEG5_MASK                       equ 0020h
LCDDATA6_SEG6_POSN                       equ 0006h
LCDDATA6_SEG6_POSITION                   equ 0006h
LCDDATA6_SEG6_SIZE                       equ 0001h
LCDDATA6_SEG6_LENGTH                     equ 0001h
LCDDATA6_SEG6_MASK                       equ 0040h
LCDDATA6_SEG7_POSN                       equ 0007h
LCDDATA6_SEG7_POSITION                   equ 0007h
LCDDATA6_SEG7_SIZE                       equ 0001h
LCDDATA6_SEG7_LENGTH                     equ 0001h
LCDDATA6_SEG7_MASK                       equ 0080h
LCDDATA6_SEG0COM2_POSN                   equ 0000h
LCDDATA6_SEG0COM2_POSITION               equ 0000h
LCDDATA6_SEG0COM2_SIZE                   equ 0001h
LCDDATA6_SEG0COM2_LENGTH                 equ 0001h
LCDDATA6_SEG0COM2_MASK                   equ 0001h
LCDDATA6_SEG1COM2_POSN                   equ 0001h
LCDDATA6_SEG1COM2_POSITION               equ 0001h
LCDDATA6_SEG1COM2_SIZE                   equ 0001h
LCDDATA6_SEG1COM2_LENGTH                 equ 0001h
LCDDATA6_SEG1COM2_MASK                   equ 0002h
LCDDATA6_SEG2COM2_POSN                   equ 0002h
LCDDATA6_SEG2COM2_POSITION               equ 0002h
LCDDATA6_SEG2COM2_SIZE                   equ 0001h
LCDDATA6_SEG2COM2_LENGTH                 equ 0001h
LCDDATA6_SEG2COM2_MASK                   equ 0004h
LCDDATA6_SEG3COM2_POSN                   equ 0003h
LCDDATA6_SEG3COM2_POSITION               equ 0003h
LCDDATA6_SEG3COM2_SIZE                   equ 0001h
LCDDATA6_SEG3COM2_LENGTH                 equ 0001h
LCDDATA6_SEG3COM2_MASK                   equ 0008h
LCDDATA6_SEG4COM2_POSN                   equ 0004h
LCDDATA6_SEG4COM2_POSITION               equ 0004h
LCDDATA6_SEG4COM2_SIZE                   equ 0001h
LCDDATA6_SEG4COM2_LENGTH                 equ 0001h
LCDDATA6_SEG4COM2_MASK                   equ 0010h
LCDDATA6_SEG5COM2_POSN                   equ 0005h
LCDDATA6_SEG5COM2_POSITION               equ 0005h
LCDDATA6_SEG5COM2_SIZE                   equ 0001h
LCDDATA6_SEG5COM2_LENGTH                 equ 0001h
LCDDATA6_SEG5COM2_MASK                   equ 0020h
LCDDATA6_SEG6COM2_POSN                   equ 0006h
LCDDATA6_SEG6COM2_POSITION               equ 0006h
LCDDATA6_SEG6COM2_SIZE                   equ 0001h
LCDDATA6_SEG6COM2_LENGTH                 equ 0001h
LCDDATA6_SEG6COM2_MASK                   equ 0040h
LCDDATA6_SEG7COM2_POSN                   equ 0007h
LCDDATA6_SEG7COM2_POSITION               equ 0007h
LCDDATA6_SEG7COM2_SIZE                   equ 0001h
LCDDATA6_SEG7COM2_LENGTH                 equ 0001h
LCDDATA6_SEG7COM2_MASK                   equ 0080h
LCDDATA6_S0C2_POSN                       equ 0000h
LCDDATA6_S0C2_POSITION                   equ 0000h
LCDDATA6_S0C2_SIZE                       equ 0001h
LCDDATA6_S0C2_LENGTH                     equ 0001h
LCDDATA6_S0C2_MASK                       equ 0001h
LCDDATA6_S1C2_POSN                       equ 0001h
LCDDATA6_S1C2_POSITION                   equ 0001h
LCDDATA6_S1C2_SIZE                       equ 0001h
LCDDATA6_S1C2_LENGTH                     equ 0001h
LCDDATA6_S1C2_MASK                       equ 0002h
LCDDATA6_S2C2_POSN                       equ 0002h
LCDDATA6_S2C2_POSITION                   equ 0002h
LCDDATA6_S2C2_SIZE                       equ 0001h
LCDDATA6_S2C2_LENGTH                     equ 0001h
LCDDATA6_S2C2_MASK                       equ 0004h
LCDDATA6_S3C2_POSN                       equ 0003h
LCDDATA6_S3C2_POSITION                   equ 0003h
LCDDATA6_S3C2_SIZE                       equ 0001h
LCDDATA6_S3C2_LENGTH                     equ 0001h
LCDDATA6_S3C2_MASK                       equ 0008h
LCDDATA6_S4C2_POSN                       equ 0004h
LCDDATA6_S4C2_POSITION                   equ 0004h
LCDDATA6_S4C2_SIZE                       equ 0001h
LCDDATA6_S4C2_LENGTH                     equ 0001h
LCDDATA6_S4C2_MASK                       equ 0010h
LCDDATA6_S5C2_POSN                       equ 0005h
LCDDATA6_S5C2_POSITION                   equ 0005h
LCDDATA6_S5C2_SIZE                       equ 0001h
LCDDATA6_S5C2_LENGTH                     equ 0001h
LCDDATA6_S5C2_MASK                       equ 0020h
LCDDATA6_S6C2_POSN                       equ 0006h
LCDDATA6_S6C2_POSITION                   equ 0006h
LCDDATA6_S6C2_SIZE                       equ 0001h
LCDDATA6_S6C2_LENGTH                     equ 0001h
LCDDATA6_S6C2_MASK                       equ 0040h
LCDDATA6_S7C2_POSN                       equ 0007h
LCDDATA6_S7C2_POSITION                   equ 0007h
LCDDATA6_S7C2_SIZE                       equ 0001h
LCDDATA6_S7C2_LENGTH                     equ 0001h
LCDDATA6_S7C2_MASK                       equ 0080h

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
LCDDATA7                                 equ 0117h
// bitfield definitions
LCDDATA7_SEG8_POSN                       equ 0000h
LCDDATA7_SEG8_POSITION                   equ 0000h
LCDDATA7_SEG8_SIZE                       equ 0001h
LCDDATA7_SEG8_LENGTH                     equ 0001h
LCDDATA7_SEG8_MASK                       equ 0001h
LCDDATA7_SEG9_POSN                       equ 0001h
LCDDATA7_SEG9_POSITION                   equ 0001h
LCDDATA7_SEG9_SIZE                       equ 0001h
LCDDATA7_SEG9_LENGTH                     equ 0001h
LCDDATA7_SEG9_MASK                       equ 0002h
LCDDATA7_SEG10_POSN                      equ 0002h
LCDDATA7_SEG10_POSITION                  equ 0002h
LCDDATA7_SEG10_SIZE                      equ 0001h
LCDDATA7_SEG10_LENGTH                    equ 0001h
LCDDATA7_SEG10_MASK                      equ 0004h
LCDDATA7_SEG11_POSN                      equ 0003h
LCDDATA7_SEG11_POSITION                  equ 0003h
LCDDATA7_SEG11_SIZE                      equ 0001h
LCDDATA7_SEG11_LENGTH                    equ 0001h
LCDDATA7_SEG11_MASK                      equ 0008h
LCDDATA7_SEG12_POSN                      equ 0004h
LCDDATA7_SEG12_POSITION                  equ 0004h
LCDDATA7_SEG12_SIZE                      equ 0001h
LCDDATA7_SEG12_LENGTH                    equ 0001h
LCDDATA7_SEG12_MASK                      equ 0010h
LCDDATA7_SEG13_POSN                      equ 0005h
LCDDATA7_SEG13_POSITION                  equ 0005h
LCDDATA7_SEG13_SIZE                      equ 0001h
LCDDATA7_SEG13_LENGTH                    equ 0001h
LCDDATA7_SEG13_MASK                      equ 0020h
LCDDATA7_SEG14_POSN                      equ 0006h
LCDDATA7_SEG14_POSITION                  equ 0006h
LCDDATA7_SEG14_SIZE                      equ 0001h
LCDDATA7_SEG14_LENGTH                    equ 0001h
LCDDATA7_SEG14_MASK                      equ 0040h
LCDDATA7_SEG15_POSN                      equ 0007h
LCDDATA7_SEG15_POSITION                  equ 0007h
LCDDATA7_SEG15_SIZE                      equ 0001h
LCDDATA7_SEG15_LENGTH                    equ 0001h
LCDDATA7_SEG15_MASK                      equ 0080h
LCDDATA7_SEG8COM2_POSN                   equ 0000h
LCDDATA7_SEG8COM2_POSITION               equ 0000h
LCDDATA7_SEG8COM2_SIZE                   equ 0001h
LCDDATA7_SEG8COM2_LENGTH                 equ 0001h
LCDDATA7_SEG8COM2_MASK                   equ 0001h
LCDDATA7_SEG9COM2_POSN                   equ 0001h
LCDDATA7_SEG9COM2_POSITION               equ 0001h
LCDDATA7_SEG9COM2_SIZE                   equ 0001h
LCDDATA7_SEG9COM2_LENGTH                 equ 0001h
LCDDATA7_SEG9COM2_MASK                   equ 0002h
LCDDATA7_SEG10COM2_POSN                  equ 0002h
LCDDATA7_SEG10COM2_POSITION              equ 0002h
LCDDATA7_SEG10COM2_SIZE                  equ 0001h
LCDDATA7_SEG10COM2_LENGTH                equ 0001h
LCDDATA7_SEG10COM2_MASK                  equ 0004h
LCDDATA7_SEG11COM2_POSN                  equ 0003h
LCDDATA7_SEG11COM2_POSITION              equ 0003h
LCDDATA7_SEG11COM2_SIZE                  equ 0001h
LCDDATA7_SEG11COM2_LENGTH                equ 0001h
LCDDATA7_SEG11COM2_MASK                  equ 0008h
LCDDATA7_SEG12COM2_POSN                  equ 0004h
LCDDATA7_SEG12COM2_POSITION              equ 0004h
LCDDATA7_SEG12COM2_SIZE                  equ 0001h
LCDDATA7_SEG12COM2_LENGTH                equ 0001h
LCDDATA7_SEG12COM2_MASK                  equ 0010h
LCDDATA7_SEG13COM2_POSN                  equ 0005h
LCDDATA7_SEG13COM2_POSITION              equ 0005h
LCDDATA7_SEG13COM2_SIZE                  equ 0001h
LCDDATA7_SEG13COM2_LENGTH                equ 0001h
LCDDATA7_SEG13COM2_MASK                  equ 0020h
LCDDATA7_SEG14COM2_POSN                  equ 0006h
LCDDATA7_SEG14COM2_POSITION              equ 0006h
LCDDATA7_SEG14COM2_SIZE                  equ 0001h
LCDDATA7_SEG14COM2_LENGTH                equ 0001h
LCDDATA7_SEG14COM2_MASK                  equ 0040h
LCDDATA7_SEG15COM2_POSN                  equ 0007h
LCDDATA7_SEG15COM2_POSITION              equ 0007h
LCDDATA7_SEG15COM2_SIZE                  equ 0001h
LCDDATA7_SEG15COM2_LENGTH                equ 0001h
LCDDATA7_SEG15COM2_MASK                  equ 0080h
LCDDATA7_S8C2_POSN                       equ 0000h
LCDDATA7_S8C2_POSITION                   equ 0000h
LCDDATA7_S8C2_SIZE                       equ 0001h
LCDDATA7_S8C2_LENGTH                     equ 0001h
LCDDATA7_S8C2_MASK                       equ 0001h
LCDDATA7_S9C2_POSN                       equ 0001h
LCDDATA7_S9C2_POSITION                   equ 0001h
LCDDATA7_S9C2_SIZE                       equ 0001h
LCDDATA7_S9C2_LENGTH                     equ 0001h
LCDDATA7_S9C2_MASK                       equ 0002h
LCDDATA7_S10C2_POSN                      equ 0002h
LCDDATA7_S10C2_POSITION                  equ 0002h
LCDDATA7_S10C2_SIZE                      equ 0001h
LCDDATA7_S10C2_LENGTH                    equ 0001h
LCDDATA7_S10C2_MASK                      equ 0004h
LCDDATA7_S11C2_POSN                      equ 0003h
LCDDATA7_S11C2_POSITION                  equ 0003h
LCDDATA7_S11C2_SIZE                      equ 0001h
LCDDATA7_S11C2_LENGTH                    equ 0001h
LCDDATA7_S11C2_MASK                      equ 0008h
LCDDATA7_S12C2_POSN                      equ 0004h
LCDDATA7_S12C2_POSITION                  equ 0004h
LCDDATA7_S12C2_SIZE                      equ 0001h
LCDDATA7_S12C2_LENGTH                    equ 0001h
LCDDATA7_S12C2_MASK                      equ 0010h
LCDDATA7_S13C2_POSN                      equ 0005h
LCDDATA7_S13C2_POSITION                  equ 0005h
LCDDATA7_S13C2_SIZE                      equ 0001h
LCDDATA7_S13C2_LENGTH                    equ 0001h
LCDDATA7_S13C2_MASK                      equ 0020h
LCDDATA7_S14C2_POSN                      equ 0006h
LCDDATA7_S14C2_POSITION                  equ 0006h
LCDDATA7_S14C2_SIZE                      equ 0001h
LCDDATA7_S14C2_LENGTH                    equ 0001h
LCDDATA7_S14C2_MASK                      equ 0040h
LCDDATA7_S15C2_POSN                      equ 0007h
LCDDATA7_S15C2_POSITION                  equ 0007h
LCDDATA7_S15C2_SIZE                      equ 0001h
LCDDATA7_S15C2_LENGTH                    equ 0001h
LCDDATA7_S15C2_MASK                      equ 0080h

// Register: LCDDATA8
#define LCDDATA8 LCDDATA8
LCDDATA8                                 equ 0118h
// bitfield definitions
LCDDATA8_SEG16_POSN                      equ 0000h
LCDDATA8_SEG16_POSITION                  equ 0000h
LCDDATA8_SEG16_SIZE                      equ 0001h
LCDDATA8_SEG16_LENGTH                    equ 0001h
LCDDATA8_SEG16_MASK                      equ 0001h
LCDDATA8_SEG17_POSN                      equ 0001h
LCDDATA8_SEG17_POSITION                  equ 0001h
LCDDATA8_SEG17_SIZE                      equ 0001h
LCDDATA8_SEG17_LENGTH                    equ 0001h
LCDDATA8_SEG17_MASK                      equ 0002h
LCDDATA8_SEG18_POSN                      equ 0002h
LCDDATA8_SEG18_POSITION                  equ 0002h
LCDDATA8_SEG18_SIZE                      equ 0001h
LCDDATA8_SEG18_LENGTH                    equ 0001h
LCDDATA8_SEG18_MASK                      equ 0004h
LCDDATA8_SEG19_POSN                      equ 0003h
LCDDATA8_SEG19_POSITION                  equ 0003h
LCDDATA8_SEG19_SIZE                      equ 0001h
LCDDATA8_SEG19_LENGTH                    equ 0001h
LCDDATA8_SEG19_MASK                      equ 0008h
LCDDATA8_SEG20_POSN                      equ 0004h
LCDDATA8_SEG20_POSITION                  equ 0004h
LCDDATA8_SEG20_SIZE                      equ 0001h
LCDDATA8_SEG20_LENGTH                    equ 0001h
LCDDATA8_SEG20_MASK                      equ 0010h
LCDDATA8_SEG21_POSN                      equ 0005h
LCDDATA8_SEG21_POSITION                  equ 0005h
LCDDATA8_SEG21_SIZE                      equ 0001h
LCDDATA8_SEG21_LENGTH                    equ 0001h
LCDDATA8_SEG21_MASK                      equ 0020h
LCDDATA8_SEG22_POSN                      equ 0006h
LCDDATA8_SEG22_POSITION                  equ 0006h
LCDDATA8_SEG22_SIZE                      equ 0001h
LCDDATA8_SEG22_LENGTH                    equ 0001h
LCDDATA8_SEG22_MASK                      equ 0040h
LCDDATA8_SEG23_POSN                      equ 0007h
LCDDATA8_SEG23_POSITION                  equ 0007h
LCDDATA8_SEG23_SIZE                      equ 0001h
LCDDATA8_SEG23_LENGTH                    equ 0001h
LCDDATA8_SEG23_MASK                      equ 0080h
LCDDATA8_SEG16COM2_POSN                  equ 0000h
LCDDATA8_SEG16COM2_POSITION              equ 0000h
LCDDATA8_SEG16COM2_SIZE                  equ 0001h
LCDDATA8_SEG16COM2_LENGTH                equ 0001h
LCDDATA8_SEG16COM2_MASK                  equ 0001h
LCDDATA8_SEG17COM2_POSN                  equ 0001h
LCDDATA8_SEG17COM2_POSITION              equ 0001h
LCDDATA8_SEG17COM2_SIZE                  equ 0001h
LCDDATA8_SEG17COM2_LENGTH                equ 0001h
LCDDATA8_SEG17COM2_MASK                  equ 0002h
LCDDATA8_SEG18COM2_POSN                  equ 0002h
LCDDATA8_SEG18COM2_POSITION              equ 0002h
LCDDATA8_SEG18COM2_SIZE                  equ 0001h
LCDDATA8_SEG18COM2_LENGTH                equ 0001h
LCDDATA8_SEG18COM2_MASK                  equ 0004h
LCDDATA8_SEG19COM2_POSN                  equ 0003h
LCDDATA8_SEG19COM2_POSITION              equ 0003h
LCDDATA8_SEG19COM2_SIZE                  equ 0001h
LCDDATA8_SEG19COM2_LENGTH                equ 0001h
LCDDATA8_SEG19COM2_MASK                  equ 0008h
LCDDATA8_SEG20COM2_POSN                  equ 0004h
LCDDATA8_SEG20COM2_POSITION              equ 0004h
LCDDATA8_SEG20COM2_SIZE                  equ 0001h
LCDDATA8_SEG20COM2_LENGTH                equ 0001h
LCDDATA8_SEG20COM2_MASK                  equ 0010h
LCDDATA8_SEG21COM2_POSN                  equ 0005h
LCDDATA8_SEG21COM2_POSITION              equ 0005h
LCDDATA8_SEG21COM2_SIZE                  equ 0001h
LCDDATA8_SEG21COM2_LENGTH                equ 0001h
LCDDATA8_SEG21COM2_MASK                  equ 0020h
LCDDATA8_SEG22COM2_POSN                  equ 0006h
LCDDATA8_SEG22COM2_POSITION              equ 0006h
LCDDATA8_SEG22COM2_SIZE                  equ 0001h
LCDDATA8_SEG22COM2_LENGTH                equ 0001h
LCDDATA8_SEG22COM2_MASK                  equ 0040h
LCDDATA8_SEG23COM2_POSN                  equ 0007h
LCDDATA8_SEG23COM2_POSITION              equ 0007h
LCDDATA8_SEG23COM2_SIZE                  equ 0001h
LCDDATA8_SEG23COM2_LENGTH                equ 0001h
LCDDATA8_SEG23COM2_MASK                  equ 0080h
LCDDATA8_S16C2_POSN                      equ 0000h
LCDDATA8_S16C2_POSITION                  equ 0000h
LCDDATA8_S16C2_SIZE                      equ 0001h
LCDDATA8_S16C2_LENGTH                    equ 0001h
LCDDATA8_S16C2_MASK                      equ 0001h
LCDDATA8_S17C2_POSN                      equ 0001h
LCDDATA8_S17C2_POSITION                  equ 0001h
LCDDATA8_S17C2_SIZE                      equ 0001h
LCDDATA8_S17C2_LENGTH                    equ 0001h
LCDDATA8_S17C2_MASK                      equ 0002h
LCDDATA8_S18C2_POSN                      equ 0002h
LCDDATA8_S18C2_POSITION                  equ 0002h
LCDDATA8_S18C2_SIZE                      equ 0001h
LCDDATA8_S18C2_LENGTH                    equ 0001h
LCDDATA8_S18C2_MASK                      equ 0004h
LCDDATA8_S19C2_POSN                      equ 0003h
LCDDATA8_S19C2_POSITION                  equ 0003h
LCDDATA8_S19C2_SIZE                      equ 0001h
LCDDATA8_S19C2_LENGTH                    equ 0001h
LCDDATA8_S19C2_MASK                      equ 0008h
LCDDATA8_S20C2_POSN                      equ 0004h
LCDDATA8_S20C2_POSITION                  equ 0004h
LCDDATA8_S20C2_SIZE                      equ 0001h
LCDDATA8_S20C2_LENGTH                    equ 0001h
LCDDATA8_S20C2_MASK                      equ 0010h
LCDDATA8_S21C2_POSN                      equ 0005h
LCDDATA8_S21C2_POSITION                  equ 0005h
LCDDATA8_S21C2_SIZE                      equ 0001h
LCDDATA8_S21C2_LENGTH                    equ 0001h
LCDDATA8_S21C2_MASK                      equ 0020h
LCDDATA8_S22C2_POSN                      equ 0006h
LCDDATA8_S22C2_POSITION                  equ 0006h
LCDDATA8_S22C2_SIZE                      equ 0001h
LCDDATA8_S22C2_LENGTH                    equ 0001h
LCDDATA8_S22C2_MASK                      equ 0040h
LCDDATA8_S23C2_POSN                      equ 0007h
LCDDATA8_S23C2_POSITION                  equ 0007h
LCDDATA8_S23C2_SIZE                      equ 0001h
LCDDATA8_S23C2_LENGTH                    equ 0001h
LCDDATA8_S23C2_MASK                      equ 0080h

