GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
LCDDATA9                                 equ 0119h
// bitfield definitions
LCDDATA9_SEG0_POSN                       equ 0000h
LCDDATA9_SEG0_POSITION                   equ 0000h
LCDDATA9_SEG0_SIZE                       equ 0001h
LCDDATA9_SEG0_LENGTH                     equ 0001h
LCDDATA9_SEG0_MASK                       equ 0001h
LCDDATA9_SEG1_POSN                       equ 0001h
LCDDATA9_SEG1_POSITION                   equ 0001h
LCDDATA9_SEG1_SIZE                       equ 0001h
LCDDATA9_SEG1_LENGTH                     equ 0001h
LCDDATA9_SEG1_MASK                       equ 0002h
LCDDATA9_SEG2_POSN                       equ 0002h
LCDDATA9_SEG2_POSITION                   equ 0002h
LCDDATA9_SEG2_SIZE                       equ 0001h
LCDDATA9_SEG2_LENGTH                     equ 0001h
LCDDATA9_SEG2_MASK                       equ 0004h
LCDDATA9_SEG3_POSN                       equ 0003h
LCDDATA9_SEG3_POSITION                   equ 0003h
LCDDATA9_SEG3_SIZE                       equ 0001h
LCDDATA9_SEG3_LENGTH                     equ 0001h
LCDDATA9_SEG3_MASK                       equ 0008h
LCDDATA9_SEG4_POSN                       equ 0004h
LCDDATA9_SEG4_POSITION                   equ 0004h
LCDDATA9_SEG4_SIZE                       equ 0001h
LCDDATA9_SEG4_LENGTH                     equ 0001h
LCDDATA9_SEG4_MASK                       equ 0010h
LCDDATA9_SEG5_POSN                       equ 0005h
LCDDATA9_SEG5_POSITION                   equ 0005h
LCDDATA9_SEG5_SIZE                       equ 0001h
LCDDATA9_SEG5_LENGTH                     equ 0001h
LCDDATA9_SEG5_MASK                       equ 0020h
LCDDATA9_SEG6_POSN                       equ 0006h
LCDDATA9_SEG6_POSITION                   equ 0006h
LCDDATA9_SEG6_SIZE                       equ 0001h
LCDDATA9_SEG6_LENGTH                     equ 0001h
LCDDATA9_SEG6_MASK                       equ 0040h
LCDDATA9_SEG7_POSN                       equ 0007h
LCDDATA9_SEG7_POSITION                   equ 0007h
LCDDATA9_SEG7_SIZE                       equ 0001h
LCDDATA9_SEG7_LENGTH                     equ 0001h
LCDDATA9_SEG7_MASK                       equ 0080h
LCDDATA9_SEG0COM3_POSN                   equ 0000h
LCDDATA9_SEG0COM3_POSITION               equ 0000h
LCDDATA9_SEG0COM3_SIZE                   equ 0001h
LCDDATA9_SEG0COM3_LENGTH                 equ 0001h
LCDDATA9_SEG0COM3_MASK                   equ 0001h
LCDDATA9_SEG1COM3_POSN                   equ 0001h
LCDDATA9_SEG1COM3_POSITION               equ 0001h
LCDDATA9_SEG1COM3_SIZE                   equ 0001h
LCDDATA9_SEG1COM3_LENGTH                 equ 0001h
LCDDATA9_SEG1COM3_MASK                   equ 0002h
LCDDATA9_SEG2COM3_POSN                   equ 0002h
LCDDATA9_SEG2COM3_POSITION               equ 0002h
LCDDATA9_SEG2COM3_SIZE                   equ 0001h
LCDDATA9_SEG2COM3_LENGTH                 equ 0001h
LCDDATA9_SEG2COM3_MASK                   equ 0004h
LCDDATA9_SEG3COM3_POSN                   equ 0003h
LCDDATA9_SEG3COM3_POSITION               equ 0003h
LCDDATA9_SEG3COM3_SIZE                   equ 0001h
LCDDATA9_SEG3COM3_LENGTH                 equ 0001h
LCDDATA9_SEG3COM3_MASK                   equ 0008h
LCDDATA9_SEG4COM3_POSN                   equ 0004h
LCDDATA9_SEG4COM3_POSITION               equ 0004h
LCDDATA9_SEG4COM3_SIZE                   equ 0001h
LCDDATA9_SEG4COM3_LENGTH                 equ 0001h
LCDDATA9_SEG4COM3_MASK                   equ 0010h
LCDDATA9_SEG5COM3_POSN                   equ 0005h
LCDDATA9_SEG5COM3_POSITION               equ 0005h
LCDDATA9_SEG5COM3_SIZE                   equ 0001h
LCDDATA9_SEG5COM3_LENGTH                 equ 0001h
LCDDATA9_SEG5COM3_MASK                   equ 0020h
LCDDATA9_SEG6COM3_POSN                   equ 0006h
LCDDATA9_SEG6COM3_POSITION               equ 0006h
LCDDATA9_SEG6COM3_SIZE                   equ 0001h
LCDDATA9_SEG6COM3_LENGTH                 equ 0001h
LCDDATA9_SEG6COM3_MASK                   equ 0040h
LCDDATA9_SEG7COM3_POSN                   equ 0007h
LCDDATA9_SEG7COM3_POSITION               equ 0007h
LCDDATA9_SEG7COM3_SIZE                   equ 0001h
LCDDATA9_SEG7COM3_LENGTH                 equ 0001h
LCDDATA9_SEG7COM3_MASK                   equ 0080h
LCDDATA9_S0C3_POSN                       equ 0000h
LCDDATA9_S0C3_POSITION                   equ 0000h
LCDDATA9_S0C3_SIZE                       equ 0001h
LCDDATA9_S0C3_LENGTH                     equ 0001h
LCDDATA9_S0C3_MASK                       equ 0001h
LCDDATA9_S1C3_POSN                       equ 0001h
LCDDATA9_S1C3_POSITION                   equ 0001h
LCDDATA9_S1C3_SIZE                       equ 0001h
LCDDATA9_S1C3_LENGTH                     equ 0001h
LCDDATA9_S1C3_MASK                       equ 0002h
LCDDATA9_S2C3_POSN                       equ 0002h
LCDDATA9_S2C3_POSITION                   equ 0002h
LCDDATA9_S2C3_SIZE                       equ 0001h
LCDDATA9_S2C3_LENGTH                     equ 0001h
LCDDATA9_S2C3_MASK                       equ 0004h
LCDDATA9_S3C3_POSN                       equ 0003h
LCDDATA9_S3C3_POSITION                   equ 0003h
LCDDATA9_S3C3_SIZE                       equ 0001h
LCDDATA9_S3C3_LENGTH                     equ 0001h
LCDDATA9_S3C3_MASK                       equ 0008h
LCDDATA9_S4C3_POSN                       equ 0004h
LCDDATA9_S4C3_POSITION                   equ 0004h
LCDDATA9_S4C3_SIZE                       equ 0001h
LCDDATA9_S4C3_LENGTH                     equ 0001h
LCDDATA9_S4C3_MASK                       equ 0010h
LCDDATA9_S5C3_POSN                       equ 0005h
LCDDATA9_S5C3_POSITION                   equ 0005h
LCDDATA9_S5C3_SIZE                       equ 0001h
LCDDATA9_S5C3_LENGTH                     equ 0001h
LCDDATA9_S5C3_MASK                       equ 0020h
LCDDATA9_S6C3_POSN                       equ 0006h
LCDDATA9_S6C3_POSITION                   equ 0006h
LCDDATA9_S6C3_SIZE                       equ 0001h
LCDDATA9_S6C3_LENGTH                     equ 0001h
LCDDATA9_S6C3_MASK                       equ 0040h
LCDDATA9_S7C3_POSN                       equ 0007h
LCDDATA9_S7C3_POSITION                   equ 0007h
LCDDATA9_S7C3_SIZE                       equ 0001h
LCDDATA9_S7C3_LENGTH                     equ 0001h
LCDDATA9_S7C3_MASK                       equ 0080h

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
LCDDATA10                                equ 011Ah
// bitfield definitions
LCDDATA10_SEG8_POSN                      equ 0000h
LCDDATA10_SEG8_POSITION                  equ 0000h
LCDDATA10_SEG8_SIZE                      equ 0001h
LCDDATA10_SEG8_LENGTH                    equ 0001h
LCDDATA10_SEG8_MASK                      equ 0001h
LCDDATA10_SEG9_POSN                      equ 0001h
LCDDATA10_SEG9_POSITION                  equ 0001h
LCDDATA10_SEG9_SIZE                      equ 0001h
LCDDATA10_SEG9_LENGTH                    equ 0001h
LCDDATA10_SEG9_MASK                      equ 0002h
LCDDATA10_SEG10_POSN                     equ 0002h
LCDDATA10_SEG10_POSITION                 equ 0002h
LCDDATA10_SEG10_SIZE                     equ 0001h
LCDDATA10_SEG10_LENGTH                   equ 0001h
LCDDATA10_SEG10_MASK                     equ 0004h
LCDDATA10_SEG11_POSN                     equ 0003h
LCDDATA10_SEG11_POSITION                 equ 0003h
LCDDATA10_SEG11_SIZE                     equ 0001h
LCDDATA10_SEG11_LENGTH                   equ 0001h
LCDDATA10_SEG11_MASK                     equ 0008h
LCDDATA10_SEG12_POSN                     equ 0004h
LCDDATA10_SEG12_POSITION                 equ 0004h
LCDDATA10_SEG12_SIZE                     equ 0001h
LCDDATA10_SEG12_LENGTH                   equ 0001h
LCDDATA10_SEG12_MASK                     equ 0010h
LCDDATA10_SEG13_POSN                     equ 0005h
LCDDATA10_SEG13_POSITION                 equ 0005h
LCDDATA10_SEG13_SIZE                     equ 0001h
LCDDATA10_SEG13_LENGTH                   equ 0001h
LCDDATA10_SEG13_MASK                     equ 0020h
LCDDATA10_SEG14_POSN                     equ 0006h
LCDDATA10_SEG14_POSITION                 equ 0006h
LCDDATA10_SEG14_SIZE                     equ 0001h
LCDDATA10_SEG14_LENGTH                   equ 0001h
LCDDATA10_SEG14_MASK                     equ 0040h
LCDDATA10_SEG15_POSN                     equ 0007h
LCDDATA10_SEG15_POSITION                 equ 0007h
LCDDATA10_SEG15_SIZE                     equ 0001h
LCDDATA10_SEG15_LENGTH                   equ 0001h
LCDDATA10_SEG15_MASK                     equ 0080h
LCDDATA10_SEG8COM3_POSN                  equ 0000h
LCDDATA10_SEG8COM3_POSITION              equ 0000h
LCDDATA10_SEG8COM3_SIZE                  equ 0001h
LCDDATA10_SEG8COM3_LENGTH                equ 0001h
LCDDATA10_SEG8COM3_MASK                  equ 0001h
LCDDATA10_SEG9COM3_POSN                  equ 0001h
LCDDATA10_SEG9COM3_POSITION              equ 0001h
LCDDATA10_SEG9COM3_SIZE                  equ 0001h
LCDDATA10_SEG9COM3_LENGTH                equ 0001h
LCDDATA10_SEG9COM3_MASK                  equ 0002h
LCDDATA10_SEG10COM3_POSN                 equ 0002h
LCDDATA10_SEG10COM3_POSITION             equ 0002h
LCDDATA10_SEG10COM3_SIZE                 equ 0001h
LCDDATA10_SEG10COM3_LENGTH               equ 0001h
LCDDATA10_SEG10COM3_MASK                 equ 0004h
LCDDATA10_SEG11COM3_POSN                 equ 0003h
LCDDATA10_SEG11COM3_POSITION             equ 0003h
LCDDATA10_SEG11COM3_SIZE                 equ 0001h
LCDDATA10_SEG11COM3_LENGTH               equ 0001h
LCDDATA10_SEG11COM3_MASK                 equ 0008h
LCDDATA10_SEG12COM3_POSN                 equ 0004h
LCDDATA10_SEG12COM3_POSITION             equ 0004h
LCDDATA10_SEG12COM3_SIZE                 equ 0001h
LCDDATA10_SEG12COM3_LENGTH               equ 0001h
LCDDATA10_SEG12COM3_MASK                 equ 0010h
LCDDATA10_SEG13COM3_POSN                 equ 0005h
LCDDATA10_SEG13COM3_POSITION             equ 0005h
LCDDATA10_SEG13COM3_SIZE                 equ 0001h
LCDDATA10_SEG13COM3_LENGTH               equ 0001h
LCDDATA10_SEG13COM3_MASK                 equ 0020h
LCDDATA10_SEG14COM3_POSN                 equ 0006h
LCDDATA10_SEG14COM3_POSITION             equ 0006h
LCDDATA10_SEG14COM3_SIZE                 equ 0001h
LCDDATA10_SEG14COM3_LENGTH               equ 0001h
LCDDATA10_SEG14COM3_MASK                 equ 0040h
LCDDATA10_SEG15COM3_POSN                 equ 0007h
LCDDATA10_SEG15COM3_POSITION             equ 0007h
LCDDATA10_SEG15COM3_SIZE                 equ 0001h
LCDDATA10_SEG15COM3_LENGTH               equ 0001h
LCDDATA10_SEG15COM3_MASK                 equ 0080h
LCDDATA10_S8C3_POSN                      equ 0000h
LCDDATA10_S8C3_POSITION                  equ 0000h
LCDDATA10_S8C3_SIZE                      equ 0001h
LCDDATA10_S8C3_LENGTH                    equ 0001h
LCDDATA10_S8C3_MASK                      equ 0001h
LCDDATA10_S9C3_POSN                      equ 0001h
LCDDATA10_S9C3_POSITION                  equ 0001h
LCDDATA10_S9C3_SIZE                      equ 0001h
LCDDATA10_S9C3_LENGTH                    equ 0001h
LCDDATA10_S9C3_MASK                      equ 0002h
LCDDATA10_S10C3_POSN                     equ 0002h
LCDDATA10_S10C3_POSITION                 equ 0002h
LCDDATA10_S10C3_SIZE                     equ 0001h
LCDDATA10_S10C3_LENGTH                   equ 0001h
LCDDATA10_S10C3_MASK                     equ 0004h
LCDDATA10_S11C3_POSN                     equ 0003h
LCDDATA10_S11C3_POSITION                 equ 0003h
LCDDATA10_S11C3_SIZE                     equ 0001h
LCDDATA10_S11C3_LENGTH                   equ 0001h
LCDDATA10_S11C3_MASK                     equ 0008h
LCDDATA10_S12C3_POSN                     equ 0004h
LCDDATA10_S12C3_POSITION                 equ 0004h
LCDDATA10_S12C3_SIZE                     equ 0001h
LCDDATA10_S12C3_LENGTH                   equ 0001h
LCDDATA10_S12C3_MASK                     equ 0010h
LCDDATA10_S13C3_POSN                     equ 0005h
LCDDATA10_S13C3_POSITION                 equ 0005h
LCDDATA10_S13C3_SIZE                     equ 0001h
LCDDATA10_S13C3_LENGTH                   equ 0001h
LCDDATA10_S13C3_MASK                     equ 0020h
LCDDATA10_S14C3_POSN                     equ 0006h
LCDDATA10_S14C3_POSITION                 equ 0006h
LCDDATA10_S14C3_SIZE                     equ 0001h
LCDDATA10_S14C3_LENGTH                   equ 0001h
LCDDATA10_S14C3_MASK                     equ 0040h
LCDDATA10_S15C3_POSN                     equ 0007h
LCDDATA10_S15C3_POSITION                 equ 0007h
LCDDATA10_S15C3_SIZE                     equ 0001h
LCDDATA10_S15C3_LENGTH                   equ 0001h
LCDDATA10_S15C3_MASK                     equ 0080h

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
LCDDATA11                                equ 011Bh
// bitfield definitions
LCDDATA11_SEG16_POSN                     equ 0000h
LCDDATA11_SEG16_POSITION                 equ 0000h
LCDDATA11_SEG16_SIZE                     equ 0001h
LCDDATA11_SEG16_LENGTH                   equ 0001h
LCDDATA11_SEG16_MASK                     equ 0001h
LCDDATA11_SEG17_POSN                     equ 0001h
LCDDATA11_SEG17_POSITION                 equ 0001h
LCDDATA11_SEG17_SIZE                     equ 0001h
LCDDATA11_SEG17_LENGTH                   equ 0001h
LCDDATA11_SEG17_MASK                     equ 0002h
LCDDATA11_SEG18_POSN                     equ 0002h
LCDDATA11_SEG18_POSITION                 equ 0002h
LCDDATA11_SEG18_SIZE                     equ 0001h
LCDDATA11_SEG18_LENGTH                   equ 0001h
LCDDATA11_SEG18_MASK                     equ 0004h
LCDDATA11_SEG19_POSN                     equ 0003h
LCDDATA11_SEG19_POSITION                 equ 0003h
LCDDATA11_SEG19_SIZE                     equ 0001h
LCDDATA11_SEG19_LENGTH                   equ 0001h
LCDDATA11_SEG19_MASK                     equ 0008h
LCDDATA11_SEG20_POSN                     equ 0004h
LCDDATA11_SEG20_POSITION                 equ 0004h
LCDDATA11_SEG20_SIZE                     equ 0001h
LCDDATA11_SEG20_LENGTH                   equ 0001h
LCDDATA11_SEG20_MASK                     equ 0010h
LCDDATA11_SEG21_POSN                     equ 0005h
LCDDATA11_SEG21_POSITION                 equ 0005h
LCDDATA11_SEG21_SIZE                     equ 0001h
LCDDATA11_SEG21_LENGTH                   equ 0001h
LCDDATA11_SEG21_MASK                     equ 0020h
LCDDATA11_SEG22_POSN                     equ 0006h
LCDDATA11_SEG22_POSITION                 equ 0006h
LCDDATA11_SEG22_SIZE                     equ 0001h
LCDDATA11_SEG22_LENGTH                   equ 0001h
LCDDATA11_SEG22_MASK                     equ 0040h
LCDDATA11_SEG23_POSN                     equ 0007h
LCDDATA11_SEG23_POSITION                 equ 0007h
LCDDATA11_SEG23_SIZE                     equ 0001h
LCDDATA11_SEG23_LENGTH                   equ 0001h
LCDDATA11_SEG23_MASK                     equ 0080h
LCDDATA11_SEG16COM3_POSN                 equ 0000h
LCDDATA11_SEG16COM3_POSITION             equ 0000h
LCDDATA11_SEG16COM3_SIZE                 equ 0001h
LCDDATA11_SEG16COM3_LENGTH               equ 0001h
LCDDATA11_SEG16COM3_MASK                 equ 0001h
LCDDATA11_SEG17COM3_POSN                 equ 0001h
LCDDATA11_SEG17COM3_POSITION             equ 0001h
LCDDATA11_SEG17COM3_SIZE                 equ 0001h
LCDDATA11_SEG17COM3_LENGTH               equ 0001h
LCDDATA11_SEG17COM3_MASK                 equ 0002h
LCDDATA11_SEG18COM3_POSN                 equ 0002h
LCDDATA11_SEG18COM3_POSITION             equ 0002h
LCDDATA11_SEG18COM3_SIZE                 equ 0001h
LCDDATA11_SEG18COM3_LENGTH               equ 0001h
LCDDATA11_SEG18COM3_MASK                 equ 0004h
LCDDATA11_SEG19COM3_POSN                 equ 0003h
LCDDATA11_SEG19COM3_POSITION             equ 0003h
LCDDATA11_SEG19COM3_SIZE                 equ 0001h
LCDDATA11_SEG19COM3_LENGTH               equ 0001h
LCDDATA11_SEG19COM3_MASK                 equ 0008h
LCDDATA11_SEG20COM3_POSN                 equ 0004h
LCDDATA11_SEG20COM3_POSITION             equ 0004h
LCDDATA11_SEG20COM3_SIZE                 equ 0001h
LCDDATA11_SEG20COM3_LENGTH               equ 0001h
LCDDATA11_SEG20COM3_MASK                 equ 0010h
LCDDATA11_SEG21COM3_POSN                 equ 0005h
LCDDATA11_SEG21COM3_POSITION             equ 0005h
LCDDATA11_SEG21COM3_SIZE                 equ 0001h
LCDDATA11_SEG21COM3_LENGTH               equ 0001h
LCDDATA11_SEG21COM3_MASK                 equ 0020h
LCDDATA11_SEG22COM3_POSN                 equ 0006h
LCDDATA11_SEG22COM3_POSITION             equ 0006h
LCDDATA11_SEG22COM3_SIZE                 equ 0001h
LCDDATA11_SEG22COM3_LENGTH               equ 0001h
LCDDATA11_SEG22COM3_MASK                 equ 0040h
LCDDATA11_SEG23COM3_POSN                 equ 0007h
LCDDATA11_SEG23COM3_POSITION             equ 0007h
LCDDATA11_SEG23COM3_SIZE                 equ 0001h
LCDDATA11_SEG23COM3_LENGTH               equ 0001h
LCDDATA11_SEG23COM3_MASK                 equ 0080h
LCDDATA11_S16C3_POSN                     equ 0000h
LCDDATA11_S16C3_POSITION                 equ 0000h
LCDDATA11_S16C3_SIZE                     equ 0001h
LCDDATA11_S16C3_LENGTH                   equ 0001h
LCDDATA11_S16C3_MASK                     equ 0001h
LCDDATA11_S17C3_POSN                     equ 0001h
LCDDATA11_S17C3_POSITION                 equ 0001h
LCDDATA11_S17C3_SIZE                     equ 0001h
LCDDATA11_S17C3_LENGTH                   equ 0001h
LCDDATA11_S17C3_MASK                     equ 0002h
LCDDATA11_S18C3_POSN                     equ 0002h
LCDDATA11_S18C3_POSITION                 equ 0002h
LCDDATA11_S18C3_SIZE                     equ 0001h
LCDDATA11_S18C3_LENGTH                   equ 0001h
LCDDATA11_S18C3_MASK                     equ 0004h
LCDDATA11_S19C3_POSN                     equ 0003h
LCDDATA11_S19C3_POSITION                 equ 0003h
LCDDATA11_S19C3_SIZE                     equ 0001h
LCDDATA11_S19C3_LENGTH                   equ 0001h
LCDDATA11_S19C3_MASK                     equ 0008h
LCDDATA11_S20C3_POSN                     equ 0004h
LCDDATA11_S20C3_POSITION                 equ 0004h
LCDDATA11_S20C3_SIZE                     equ 0001h
LCDDATA11_S20C3_LENGTH                   equ 0001h
LCDDATA11_S20C3_MASK                     equ 0010h
LCDDATA11_S21C3_POSN                     equ 0005h
LCDDATA11_S21C3_POSITION                 equ 0005h
LCDDATA11_S21C3_SIZE                     equ 0001h
LCDDATA11_S21C3_LENGTH                   equ 0001h
LCDDATA11_S21C3_MASK                     equ 0020h
LCDDATA11_S22C3_POSN                     equ 0006h
LCDDATA11_S22C3_POSITION                 equ 0006h
LCDDATA11_S22C3_SIZE                     equ 0001h
LCDDATA11_S22C3_LENGTH                   equ 0001h
LCDDATA11_S22C3_MASK                     equ 0040h
LCDDATA11_S23C3_POSN                     equ 0007h
LCDDATA11_S23C3_POSITION                 equ 0007h
LCDDATA11_S23C3_SIZE                     equ 0001h
LCDDATA11_S23C3_LENGTH                   equ 0001h
LCDDATA11_S23C3_MASK                     equ 0080h

