GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
// Register: TRISF
#define TRISF TRISF
TRISF                                    equ 0185h
// bitfield definitions
TRISF_TRISF0_POSN                        equ 0000h
TRISF_TRISF0_POSITION                    equ 0000h
TRISF_TRISF0_SIZE                        equ 0001h
TRISF_TRISF0_LENGTH                      equ 0001h
TRISF_TRISF0_MASK                        equ 0001h
TRISF_TRISF1_POSN                        equ 0001h
TRISF_TRISF1_POSITION                    equ 0001h
TRISF_TRISF1_SIZE                        equ 0001h
TRISF_TRISF1_LENGTH                      equ 0001h
TRISF_TRISF1_MASK                        equ 0002h
TRISF_TRISF2_POSN                        equ 0002h
TRISF_TRISF2_POSITION                    equ 0002h
TRISF_TRISF2_SIZE                        equ 0001h
TRISF_TRISF2_LENGTH                      equ 0001h
TRISF_TRISF2_MASK                        equ 0004h
TRISF_TRISF3_POSN                        equ 0003h
TRISF_TRISF3_POSITION                    equ 0003h
TRISF_TRISF3_SIZE                        equ 0001h
TRISF_TRISF3_LENGTH                      equ 0001h
TRISF_TRISF3_MASK                        equ 0008h
TRISF_TRISF4_POSN                        equ 0004h
TRISF_TRISF4_POSITION                    equ 0004h
TRISF_TRISF4_SIZE                        equ 0001h
TRISF_TRISF4_LENGTH                      equ 0001h
TRISF_TRISF4_MASK                        equ 0010h
TRISF_TRISF5_POSN                        equ 0005h
TRISF_TRISF5_POSITION                    equ 0005h
TRISF_TRISF5_SIZE                        equ 0001h
TRISF_TRISF5_LENGTH                      equ 0001h
TRISF_TRISF5_MASK                        equ 0020h
TRISF_TRISF6_POSN                        equ 0006h
TRISF_TRISF6_POSITION                    equ 0006h
TRISF_TRISF6_SIZE                        equ 0001h
TRISF_TRISF6_LENGTH                      equ 0001h
TRISF_TRISF6_MASK                        equ 0040h
TRISF_TRISF7_POSN                        equ 0007h
TRISF_TRISF7_POSITION                    equ 0007h
TRISF_TRISF7_SIZE                        equ 0001h
TRISF_TRISF7_LENGTH                      equ 0001h
TRISF_TRISF7_MASK                        equ 0080h

// Register: TRISG
#define TRISG TRISG
TRISG                                    equ 0187h
// bitfield definitions
TRISG_TRISG0_POSN                        equ 0000h
TRISG_TRISG0_POSITION                    equ 0000h
TRISG_TRISG0_SIZE                        equ 0001h
TRISG_TRISG0_LENGTH                      equ 0001h
TRISG_TRISG0_MASK                        equ 0001h
TRISG_TRISG1_POSN                        equ 0001h
TRISG_TRISG1_POSITION                    equ 0001h
TRISG_TRISG1_SIZE                        equ 0001h
TRISG_TRISG1_LENGTH                      equ 0001h
TRISG_TRISG1_MASK                        equ 0002h
TRISG_TRISG2_POSN                        equ 0002h
TRISG_TRISG2_POSITION                    equ 0002h
TRISG_TRISG2_SIZE                        equ 0001h
TRISG_TRISG2_LENGTH                      equ 0001h
TRISG_TRISG2_MASK                        equ 0004h
TRISG_TRISG3_POSN                        equ 0003h
TRISG_TRISG3_POSITION                    equ 0003h
TRISG_TRISG3_SIZE                        equ 0001h
TRISG_TRISG3_LENGTH                      equ 0001h
TRISG_TRISG3_MASK                        equ 0008h
TRISG_TRISG4_POSN                        equ 0004h
TRISG_TRISG4_POSITION                    equ 0004h
TRISG_TRISG4_SIZE                        equ 0001h
TRISG_TRISG4_LENGTH                      equ 0001h
TRISG_TRISG4_MASK                        equ 0010h
TRISG_TRISG5_POSN                        equ 0005h
TRISG_TRISG5_POSITION                    equ 0005h
TRISG_TRISG5_SIZE                        equ 0001h
TRISG_TRISG5_LENGTH                      equ 0001h
TRISG_TRISG5_MASK                        equ 0020h

// Register: PORTF
#define PORTF PORTF
PORTF                                    equ 0188h
// bitfield definitions
PORTF_RF0_POSN                           equ 0000h
PORTF_RF0_POSITION                       equ 0000h
PORTF_RF0_SIZE                           equ 0001h
PORTF_RF0_LENGTH                         equ 0001h
PORTF_RF0_MASK                           equ 0001h
PORTF_RF1_POSN                           equ 0001h
PORTF_RF1_POSITION                       equ 0001h
PORTF_RF1_SIZE                           equ 0001h
PORTF_RF1_LENGTH                         equ 0001h
PORTF_RF1_MASK                           equ 0002h
PORTF_RF2_POSN                           equ 0002h
PORTF_RF2_POSITION                       equ 0002h
PORTF_RF2_SIZE                           equ 0001h
PORTF_RF2_LENGTH                         equ 0001h
PORTF_RF2_MASK                           equ 0004h
PORTF_RF3_POSN                           equ 0003h
PORTF_RF3_POSITION                       equ 0003h
PORTF_RF3_SIZE                           equ 0001h
PORTF_RF3_LENGTH                         equ 0001h
PORTF_RF3_MASK                           equ 0008h
PORTF_RF4_POSN                           equ 0004h
PORTF_RF4_POSITION                       equ 0004h
PORTF_RF4_SIZE                           equ 0001h
PORTF_RF4_LENGTH                         equ 0001h
PORTF_RF4_MASK                           equ 0010h
PORTF_RF5_POSN                           equ 0005h
PORTF_RF5_POSITION                       equ 0005h
PORTF_RF5_SIZE                           equ 0001h
PORTF_RF5_LENGTH                         equ 0001h
PORTF_RF5_MASK                           equ 0020h
PORTF_RF6_POSN                           equ 0006h
PORTF_RF6_POSITION                       equ 0006h
PORTF_RF6_SIZE                           equ 0001h
PORTF_RF6_LENGTH                         equ 0001h
PORTF_RF6_MASK                           equ 0040h
PORTF_RF7_POSN                           equ 0007h
PORTF_RF7_POSITION                       equ 0007h
PORTF_RF7_SIZE                           equ 0001h
PORTF_RF7_LENGTH                         equ 0001h
PORTF_RF7_MASK                           equ 0080h

// Register: PORTG
#define PORTG PORTG
PORTG                                    equ 0189h
// bitfield definitions
PORTG_RG0_POSN                           equ 0000h
PORTG_RG0_POSITION                       equ 0000h
PORTG_RG0_SIZE                           equ 0001h
PORTG_RG0_LENGTH                         equ 0001h
PORTG_RG0_MASK                           equ 0001h
PORTG_RG1_POSN                           equ 0001h
PORTG_RG1_POSITION                       equ 0001h
PORTG_RG1_SIZE                           equ 0001h
PORTG_RG1_LENGTH                         equ 0001h
PORTG_RG1_MASK                           equ 0002h
PORTG_RG2_POSN                           equ 0002h
PORTG_RG2_POSITION                       equ 0002h
PORTG_RG2_SIZE                           equ 0001h
PORTG_RG2_LENGTH                         equ 0001h
PORTG_RG2_MASK                           equ 0004h
PORTG_RG3_POSN                           equ 0003h
PORTG_RG3_POSITION                       equ 0003h
PORTG_RG3_SIZE                           equ 0001h
PORTG_RG3_LENGTH                         equ 0001h
PORTG_RG3_MASK                           equ 0008h
PORTG_RG4_POSN                           equ 0004h
PORTG_RG4_POSITION                       equ 0004h
PORTG_RG4_SIZE                           equ 0001h
PORTG_RG4_LENGTH                         equ 0001h
PORTG_RG4_MASK                           equ 0010h
PORTG_RG5_POSN                           equ 0005h
PORTG_RG5_POSITION                       equ 0005h
PORTG_RG5_SIZE                           equ 0001h
PORTG_RG5_LENGTH                         equ 0001h
PORTG_RG5_MASK                           equ 0020h

// Register: EECON1
#define EECON1 EECON1
EECON1                                   equ 018Ch
// bitfield definitions
EECON1_RD_POSN                           equ 0000h
EECON1_RD_POSITION                       equ 0000h
EECON1_RD_SIZE                           equ 0001h
EECON1_RD_LENGTH                         equ 0001h
EECON1_RD_MASK                           equ 0001h
EECON1_WR_POSN                           equ 0001h
EECON1_WR_POSITION                       equ 0001h
EECON1_WR_SIZE                           equ 0001h
EECON1_WR_LENGTH                         equ 0001h
EECON1_WR_MASK                           equ 0002h
EECON1_WREN_POSN                         equ 0002h
EECON1_WREN_POSITION                     equ 0002h
EECON1_WREN_SIZE                         equ 0001h
EECON1_WREN_LENGTH                       equ 0001h
EECON1_WREN_MASK                         equ 0004h
EECON1_WRERR_POSN                        equ 0003h
EECON1_WRERR_POSITION                    equ 0003h
EECON1_WRERR_SIZE                        equ 0001h
EECON1_WRERR_LENGTH                      equ 0001h
EECON1_WRERR_MASK                        equ 0008h
EECON1_EEPGD_POSN                        equ 0007h
EECON1_EEPGD_POSITION                    equ 0007h
EECON1_EEPGD_SIZE                        equ 0001h
EECON1_EEPGD_LENGTH                      equ 0001h
EECON1_EEPGD_MASK                        equ 0080h
EECON1_EERD_POSN                         equ 0000h
EECON1_EERD_POSITION                     equ 0000h
EECON1_EERD_SIZE                         equ 0001h
EECON1_EERD_LENGTH                       equ 0001h
EECON1_EERD_MASK                         equ 0001h
EECON1_EEWR_POSN                         equ 0001h
EECON1_EEWR_POSITION                     equ 0001h
EECON1_EEWR_SIZE                         equ 0001h
EECON1_EEWR_LENGTH                       equ 0001h
EECON1_EEWR_MASK                         equ 0002h

// Register: EECON2
#define EECON2 EECON2
EECON2                                   equ 018Dh

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
LCDDATA12                                equ 0190h
// bitfield definitions
LCDDATA12_SEG24_POSN                     equ 0000h
LCDDATA12_SEG24_POSITION                 equ 0000h
LCDDATA12_SEG24_SIZE                     equ 0001h
LCDDATA12_SEG24_LENGTH                   equ 0001h
LCDDATA12_SEG24_MASK                     equ 0001h
LCDDATA12_SEG25_POSN                     equ 0001h
LCDDATA12_SEG25_POSITION                 equ 0001h
LCDDATA12_SEG25_SIZE                     equ 0001h
LCDDATA12_SEG25_LENGTH                   equ 0001h
LCDDATA12_SEG25_MASK                     equ 0002h
LCDDATA12_SEG26_POSN                     equ 0002h
LCDDATA12_SEG26_POSITION                 equ 0002h
LCDDATA12_SEG26_SIZE                     equ 0001h
LCDDATA12_SEG26_LENGTH                   equ 0001h
LCDDATA12_SEG26_MASK                     equ 0004h
LCDDATA12_SEG27_POSN                     equ 0003h
LCDDATA12_SEG27_POSITION                 equ 0003h
LCDDATA12_SEG27_SIZE                     equ 0001h
LCDDATA12_SEG27_LENGTH                   equ 0001h
LCDDATA12_SEG27_MASK                     equ 0008h
LCDDATA12_SEG28_POSN                     equ 0004h
LCDDATA12_SEG28_POSITION                 equ 0004h
LCDDATA12_SEG28_SIZE                     equ 0001h
LCDDATA12_SEG28_LENGTH                   equ 0001h
LCDDATA12_SEG28_MASK                     equ 0010h
LCDDATA12_SEG29_POSN                     equ 0005h
LCDDATA12_SEG29_POSITION                 equ 0005h
LCDDATA12_SEG29_SIZE                     equ 0001h
LCDDATA12_SEG29_LENGTH                   equ 0001h
LCDDATA12_SEG29_MASK                     equ 0020h
LCDDATA12_SEG30_POSN                     equ 0006h
LCDDATA12_SEG30_POSITION                 equ 0006h
LCDDATA12_SEG30_SIZE                     equ 0001h
LCDDATA12_SEG30_LENGTH                   equ 0001h
LCDDATA12_SEG30_MASK                     equ 0040h
LCDDATA12_SEG31_POSN                     equ 0007h
LCDDATA12_SEG31_POSITION                 equ 0007h
LCDDATA12_SEG31_SIZE                     equ 0001h
LCDDATA12_SEG31_LENGTH                   equ 0001h
LCDDATA12_SEG31_MASK                     equ 0080h
LCDDATA12_SEG24COM0_POSN                 equ 0000h
LCDDATA12_SEG24COM0_POSITION             equ 0000h
LCDDATA12_SEG24COM0_SIZE                 equ 0001h
LCDDATA12_SEG24COM0_LENGTH               equ 0001h
LCDDATA12_SEG24COM0_MASK                 equ 0001h
LCDDATA12_SEG25COM0_POSN                 equ 0001h
LCDDATA12_SEG25COM0_POSITION             equ 0001h
LCDDATA12_SEG25COM0_SIZE                 equ 0001h
LCDDATA12_SEG25COM0_LENGTH               equ 0001h
LCDDATA12_SEG25COM0_MASK                 equ 0002h
LCDDATA12_SEG26COM0_POSN                 equ 0002h
LCDDATA12_SEG26COM0_POSITION             equ 0002h
LCDDATA12_SEG26COM0_SIZE                 equ 0001h
LCDDATA12_SEG26COM0_LENGTH               equ 0001h
LCDDATA12_SEG26COM0_MASK                 equ 0004h
LCDDATA12_SEG27COM0_POSN                 equ 0003h
LCDDATA12_SEG27COM0_POSITION             equ 0003h
LCDDATA12_SEG27COM0_SIZE                 equ 0001h
LCDDATA12_SEG27COM0_LENGTH               equ 0001h
LCDDATA12_SEG27COM0_MASK                 equ 0008h
LCDDATA12_SEG28COM0_POSN                 equ 0004h
LCDDATA12_SEG28COM0_POSITION             equ 0004h
LCDDATA12_SEG28COM0_SIZE                 equ 0001h
LCDDATA12_SEG28COM0_LENGTH               equ 0001h
LCDDATA12_SEG28COM0_MASK                 equ 0010h
LCDDATA12_SEG29COM0_POSN                 equ 0005h
LCDDATA12_SEG29COM0_POSITION             equ 0005h
LCDDATA12_SEG29COM0_SIZE                 equ 0001h
LCDDATA12_SEG29COM0_LENGTH               equ 0001h
LCDDATA12_SEG29COM0_MASK                 equ 0020h
LCDDATA12_SEG30COM0_POSN                 equ 0006h
LCDDATA12_SEG30COM0_POSITION             equ 0006h
LCDDATA12_SEG30COM0_SIZE                 equ 0001h
LCDDATA12_SEG30COM0_LENGTH               equ 0001h
LCDDATA12_SEG30COM0_MASK                 equ 0040h
LCDDATA12_SEG31COM0_POSN                 equ 0007h
LCDDATA12_SEG31COM0_POSITION             equ 0007h
LCDDATA12_SEG31COM0_SIZE                 equ 0001h
LCDDATA12_SEG31COM0_LENGTH               equ 0001h
LCDDATA12_SEG31COM0_MASK                 equ 0080h
LCDDATA12_S24C0_POSN                     equ 0000h
LCDDATA12_S24C0_POSITION                 equ 0000h
LCDDATA12_S24C0_SIZE                     equ 0001h
LCDDATA12_S24C0_LENGTH                   equ 0001h
LCDDATA12_S24C0_MASK                     equ 0001h
LCDDATA12_S25C0_POSN                     equ 0001h
LCDDATA12_S25C0_POSITION                 equ 0001h
LCDDATA12_S25C0_SIZE                     equ 0001h
LCDDATA12_S25C0_LENGTH                   equ 0001h
LCDDATA12_S25C0_MASK                     equ 0002h
LCDDATA12_S26C0_POSN                     equ 0002h
LCDDATA12_S26C0_POSITION                 equ 0002h
LCDDATA12_S26C0_SIZE                     equ 0001h
LCDDATA12_S26C0_LENGTH                   equ 0001h
LCDDATA12_S26C0_MASK                     equ 0004h
LCDDATA12_S27C0_POSN                     equ 0003h
LCDDATA12_S27C0_POSITION                 equ 0003h
LCDDATA12_S27C0_SIZE                     equ 0001h
LCDDATA12_S27C0_LENGTH                   equ 0001h
LCDDATA12_S27C0_MASK                     equ 0008h
LCDDATA12_S28C0_POSN                     equ 0004h
LCDDATA12_S28C0_POSITION                 equ 0004h
LCDDATA12_S28C0_SIZE                     equ 0001h
LCDDATA12_S28C0_LENGTH                   equ 0001h
LCDDATA12_S28C0_MASK                     equ 0010h
LCDDATA12_S29C0_POSN                     equ 0005h
LCDDATA12_S29C0_POSITION                 equ 0005h
LCDDATA12_S29C0_SIZE                     equ 0001h
LCDDATA12_S29C0_LENGTH                   equ 0001h
LCDDATA12_S29C0_MASK                     equ 0020h
LCDDATA12_S30C0_POSN                     equ 0006h
LCDDATA12_S30C0_POSITION                 equ 0006h
LCDDATA12_S30C0_SIZE                     equ 0001h
LCDDATA12_S30C0_LENGTH                   equ 0001h
LCDDATA12_S30C0_MASK                     equ 0040h
LCDDATA12_S31C0_POSN                     equ 0007h
LCDDATA12_S31C0_POSITION                 equ 0007h
LCDDATA12_S31C0_SIZE                     equ 0001h
LCDDATA12_S31C0_LENGTH                   equ 0001h
LCDDATA12_S31C0_MASK                     equ 0080h

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
LCDDATA13                                equ 0191h
// bitfield definitions
LCDDATA13_SEG32_POSN                     equ 0000h
LCDDATA13_SEG32_POSITION                 equ 0000h
LCDDATA13_SEG32_SIZE                     equ 0001h
LCDDATA13_SEG32_LENGTH                   equ 0001h
LCDDATA13_SEG32_MASK                     equ 0001h
LCDDATA13_SEG33_POSN                     equ 0001h
LCDDATA13_SEG33_POSITION                 equ 0001h
LCDDATA13_SEG33_SIZE                     equ 0001h
LCDDATA13_SEG33_LENGTH                   equ 0001h
LCDDATA13_SEG33_MASK                     equ 0002h
LCDDATA13_SEG34_POSN                     equ 0002h
LCDDATA13_SEG34_POSITION                 equ 0002h
LCDDATA13_SEG34_SIZE                     equ 0001h
LCDDATA13_SEG34_LENGTH                   equ 0001h
LCDDATA13_SEG34_MASK                     equ 0004h
LCDDATA13_SEG35_POSN                     equ 0003h
LCDDATA13_SEG35_POSITION                 equ 0003h
LCDDATA13_SEG35_SIZE                     equ 0001h
LCDDATA13_SEG35_LENGTH                   equ 0001h
LCDDATA13_SEG35_MASK                     equ 0008h
LCDDATA13_SEG36_POSN                     equ 0004h
LCDDATA13_SEG36_POSITION                 equ 0004h
LCDDATA13_SEG36_SIZE                     equ 0001h
LCDDATA13_SEG36_LENGTH                   equ 0001h
LCDDATA13_SEG36_MASK                     equ 0010h
LCDDATA13_SEG37_POSN                     equ 0005h
LCDDATA13_SEG37_POSITION                 equ 0005h
LCDDATA13_SEG37_SIZE                     equ 0001h
LCDDATA13_SEG37_LENGTH                   equ 0001h
LCDDATA13_SEG37_MASK                     equ 0020h
LCDDATA13_SEG38_POSN                     equ 0006h
LCDDATA13_SEG38_POSITION                 equ 0006h
LCDDATA13_SEG38_SIZE                     equ 0001h
LCDDATA13_SEG38_LENGTH                   equ 0001h
LCDDATA13_SEG38_MASK                     equ 0040h
LCDDATA13_SEG39_POSN                     equ 0007h
LCDDATA13_SEG39_POSITION                 equ 0007h
LCDDATA13_SEG39_SIZE                     equ 0001h
LCDDATA13_SEG39_LENGTH                   equ 0001h
LCDDATA13_SEG39_MASK                     equ 0080h
LCDDATA13_SEG32COM0_POSN                 equ 0000h
LCDDATA13_SEG32COM0_POSITION             equ 0000h
LCDDATA13_SEG32COM0_SIZE                 equ 0001h
LCDDATA13_SEG32COM0_LENGTH               equ 0001h
LCDDATA13_SEG32COM0_MASK                 equ 0001h
LCDDATA13_SEG33COM0_POSN                 equ 0001h
LCDDATA13_SEG33COM0_POSITION             equ 0001h
LCDDATA13_SEG33COM0_SIZE                 equ 0001h
LCDDATA13_SEG33COM0_LENGTH               equ 0001h
LCDDATA13_SEG33COM0_MASK                 equ 0002h
LCDDATA13_SEG34COM0_POSN                 equ 0002h
LCDDATA13_SEG34COM0_POSITION             equ 0002h
LCDDATA13_SEG34COM0_SIZE                 equ 0001h
LCDDATA13_SEG34COM0_LENGTH               equ 0001h
LCDDATA13_SEG34COM0_MASK                 equ 0004h
LCDDATA13_SEG35COM0_POSN                 equ 0003h
LCDDATA13_SEG35COM0_POSITION             equ 0003h
LCDDATA13_SEG35COM0_SIZE                 equ 0001h
LCDDATA13_SEG35COM0_LENGTH               equ 0001h
LCDDATA13_SEG35COM0_MASK                 equ 0008h
LCDDATA13_SEG36COM0_POSN                 equ 0004h
LCDDATA13_SEG36COM0_POSITION             equ 0004h
LCDDATA13_SEG36COM0_SIZE                 equ 0001h
LCDDATA13_SEG36COM0_LENGTH               equ 0001h
LCDDATA13_SEG36COM0_MASK                 equ 0010h
LCDDATA13_SEG37COM0_POSN                 equ 0005h
LCDDATA13_SEG37COM0_POSITION             equ 0005h
LCDDATA13_SEG37COM0_SIZE                 equ 0001h
LCDDATA13_SEG37COM0_LENGTH               equ 0001h
LCDDATA13_SEG37COM0_MASK                 equ 0020h
LCDDATA13_SEG38COM0_POSN                 equ 0006h
LCDDATA13_SEG38COM0_POSITION             equ 0006h
LCDDATA13_SEG38COM0_SIZE                 equ 0001h
LCDDATA13_SEG38COM0_LENGTH               equ 0001h
LCDDATA13_SEG38COM0_MASK                 equ 0040h
LCDDATA13_SEG39COM0_POSN                 equ 0007h
LCDDATA13_SEG39COM0_POSITION             equ 0007h
LCDDATA13_SEG39COM0_SIZE                 equ 0001h
LCDDATA13_SEG39COM0_LENGTH               equ 0001h
LCDDATA13_SEG39COM0_MASK                 equ 0080h
LCDDATA13_S32C0_POSN                     equ 0000h
LCDDATA13_S32C0_POSITION                 equ 0000h
LCDDATA13_S32C0_SIZE                     equ 0001h
LCDDATA13_S32C0_LENGTH                   equ 0001h
LCDDATA13_S32C0_MASK                     equ 0001h
LCDDATA13_S33C0_POSN                     equ 0001h
LCDDATA13_S33C0_POSITION                 equ 0001h
LCDDATA13_S33C0_SIZE                     equ 0001h
LCDDATA13_S33C0_LENGTH                   equ 0001h
LCDDATA13_S33C0_MASK                     equ 0002h
LCDDATA13_S34C0_POSN                     equ 0002h
LCDDATA13_S34C0_POSITION                 equ 0002h
LCDDATA13_S34C0_SIZE                     equ 0001h
LCDDATA13_S34C0_LENGTH                   equ 0001h
LCDDATA13_S34C0_MASK                     equ 0004h
LCDDATA13_S35C0_POSN                     equ 0003h
LCDDATA13_S35C0_POSITION                 equ 0003h
LCDDATA13_S35C0_SIZE                     equ 0001h
LCDDATA13_S35C0_LENGTH                   equ 0001h
LCDDATA13_S35C0_MASK                     equ 0008h
LCDDATA13_S36C0_POSN                     equ 0004h
LCDDATA13_S36C0_POSITION                 equ 0004h
LCDDATA13_S36C0_SIZE                     equ 0001h
LCDDATA13_S36C0_LENGTH                   equ 0001h
LCDDATA13_S36C0_MASK                     equ 0010h
LCDDATA13_S37C0_POSN                     equ 0005h
LCDDATA13_S37C0_POSITION                 equ 0005h
LCDDATA13_S37C0_SIZE                     equ 0001h
LCDDATA13_S37C0_LENGTH                   equ 0001h
LCDDATA13_S37C0_MASK                     equ 0020h
LCDDATA13_S38C0_POSN                     equ 0006h
LCDDATA13_S38C0_POSITION                 equ 0006h
LCDDATA13_S38C0_SIZE                     equ 0001h
LCDDATA13_S38C0_LENGTH                   equ 0001h
LCDDATA13_S38C0_MASK                     equ 0040h
LCDDATA13_S39C0_POSN                     equ 0007h
LCDDATA13_S39C0_POSITION                 equ 0007h
LCDDATA13_S39C0_SIZE                     equ 0001h
LCDDATA13_S39C0_LENGTH                   equ 0001h
LCDDATA13_S39C0_MASK                     equ 0080h

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
LCDDATA14                                equ 0192h
// bitfield definitions
LCDDATA14_SEG40_POSN                     equ 0000h
LCDDATA14_SEG40_POSITION                 equ 0000h
LCDDATA14_SEG40_SIZE                     equ 0001h
LCDDATA14_SEG40_LENGTH                   equ 0001h
LCDDATA14_SEG40_MASK                     equ 0001h
LCDDATA14_SEG41_POSN                     equ 0001h
LCDDATA14_SEG41_POSITION                 equ 0001h
LCDDATA14_SEG41_SIZE                     equ 0001h
LCDDATA14_SEG41_LENGTH                   equ 0001h
LCDDATA14_SEG41_MASK                     equ 0002h
LCDDATA14_SEG40COM0_POSN                 equ 0000h
LCDDATA14_SEG40COM0_POSITION             equ 0000h
LCDDATA14_SEG40COM0_SIZE                 equ 0001h
LCDDATA14_SEG40COM0_LENGTH               equ 0001h
LCDDATA14_SEG40COM0_MASK                 equ 0001h
LCDDATA14_SEG41COM0_POSN                 equ 0001h
LCDDATA14_SEG41COM0_POSITION             equ 0001h
LCDDATA14_SEG41COM0_SIZE                 equ 0001h
LCDDATA14_SEG41COM0_LENGTH               equ 0001h
LCDDATA14_SEG41COM0_MASK                 equ 0002h
LCDDATA14_S40C0_POSN                     equ 0000h
LCDDATA14_S40C0_POSITION                 equ 0000h
LCDDATA14_S40C0_SIZE                     equ 0001h
LCDDATA14_S40C0_LENGTH                   equ 0001h
LCDDATA14_S40C0_MASK                     equ 0001h
LCDDATA14_S41C0_POSN                     equ 0001h
LCDDATA14_S41C0_POSITION                 equ 0001h
LCDDATA14_S41C0_SIZE                     equ 0001h
LCDDATA14_S41C0_LENGTH                   equ 0001h
LCDDATA14_S41C0_MASK                     equ 0002h

