GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
LCDDATA15                                equ 0193h
// bitfield definitions
LCDDATA15_SEG24_POSN                     equ 0000h
LCDDATA15_SEG24_POSITION                 equ 0000h
LCDDATA15_SEG24_SIZE                     equ 0001h
LCDDATA15_SEG24_LENGTH                   equ 0001h
LCDDATA15_SEG24_MASK                     equ 0001h
LCDDATA15_SEG25_POSN                     equ 0001h
LCDDATA15_SEG25_POSITION                 equ 0001h
LCDDATA15_SEG25_SIZE                     equ 0001h
LCDDATA15_SEG25_LENGTH                   equ 0001h
LCDDATA15_SEG25_MASK                     equ 0002h
LCDDATA15_SEG26_POSN                     equ 0002h
LCDDATA15_SEG26_POSITION                 equ 0002h
LCDDATA15_SEG26_SIZE                     equ 0001h
LCDDATA15_SEG26_LENGTH                   equ 0001h
LCDDATA15_SEG26_MASK                     equ 0004h
LCDDATA15_SEG27_POSN                     equ 0003h
LCDDATA15_SEG27_POSITION                 equ 0003h
LCDDATA15_SEG27_SIZE                     equ 0001h
LCDDATA15_SEG27_LENGTH                   equ 0001h
LCDDATA15_SEG27_MASK                     equ 0008h
LCDDATA15_SEG28_POSN                     equ 0004h
LCDDATA15_SEG28_POSITION                 equ 0004h
LCDDATA15_SEG28_SIZE                     equ 0001h
LCDDATA15_SEG28_LENGTH                   equ 0001h
LCDDATA15_SEG28_MASK                     equ 0010h
LCDDATA15_SEG29_POSN                     equ 0005h
LCDDATA15_SEG29_POSITION                 equ 0005h
LCDDATA15_SEG29_SIZE                     equ 0001h
LCDDATA15_SEG29_LENGTH                   equ 0001h
LCDDATA15_SEG29_MASK                     equ 0020h
LCDDATA15_SEG30_POSN                     equ 0006h
LCDDATA15_SEG30_POSITION                 equ 0006h
LCDDATA15_SEG30_SIZE                     equ 0001h
LCDDATA15_SEG30_LENGTH                   equ 0001h
LCDDATA15_SEG30_MASK                     equ 0040h
LCDDATA15_SEG31_POSN                     equ 0007h
LCDDATA15_SEG31_POSITION                 equ 0007h
LCDDATA15_SEG31_SIZE                     equ 0001h
LCDDATA15_SEG31_LENGTH                   equ 0001h
LCDDATA15_SEG31_MASK                     equ 0080h
LCDDATA15_SEG24COM1_POSN                 equ 0000h
LCDDATA15_SEG24COM1_POSITION             equ 0000h
LCDDATA15_SEG24COM1_SIZE                 equ 0001h
LCDDATA15_SEG24COM1_LENGTH               equ 0001h
LCDDATA15_SEG24COM1_MASK                 equ 0001h
LCDDATA15_SEG25COM1_POSN                 equ 0001h
LCDDATA15_SEG25COM1_POSITION             equ 0001h
LCDDATA15_SEG25COM1_SIZE                 equ 0001h
LCDDATA15_SEG25COM1_LENGTH               equ 0001h
LCDDATA15_SEG25COM1_MASK                 equ 0002h
LCDDATA15_SEG26COM1_POSN                 equ 0002h
LCDDATA15_SEG26COM1_POSITION             equ 0002h
LCDDATA15_SEG26COM1_SIZE                 equ 0001h
LCDDATA15_SEG26COM1_LENGTH               equ 0001h
LCDDATA15_SEG26COM1_MASK                 equ 0004h
LCDDATA15_SEG27COM1_POSN                 equ 0003h
LCDDATA15_SEG27COM1_POSITION             equ 0003h
LCDDATA15_SEG27COM1_SIZE                 equ 0001h
LCDDATA15_SEG27COM1_LENGTH               equ 0001h
LCDDATA15_SEG27COM1_MASK                 equ 0008h
LCDDATA15_SEG28COM1_POSN                 equ 0004h
LCDDATA15_SEG28COM1_POSITION             equ 0004h
LCDDATA15_SEG28COM1_SIZE                 equ 0001h
LCDDATA15_SEG28COM1_LENGTH               equ 0001h
LCDDATA15_SEG28COM1_MASK                 equ 0010h
LCDDATA15_SEG29COM1_POSN                 equ 0005h
LCDDATA15_SEG29COM1_POSITION             equ 0005h
LCDDATA15_SEG29COM1_SIZE                 equ 0001h
LCDDATA15_SEG29COM1_LENGTH               equ 0001h
LCDDATA15_SEG29COM1_MASK                 equ 0020h
LCDDATA15_SEG30COM1_POSN                 equ 0006h
LCDDATA15_SEG30COM1_POSITION             equ 0006h
LCDDATA15_SEG30COM1_SIZE                 equ 0001h
LCDDATA15_SEG30COM1_LENGTH               equ 0001h
LCDDATA15_SEG30COM1_MASK                 equ 0040h
LCDDATA15_SEG31COM1_POSN                 equ 0007h
LCDDATA15_SEG31COM1_POSITION             equ 0007h
LCDDATA15_SEG31COM1_SIZE                 equ 0001h
LCDDATA15_SEG31COM1_LENGTH               equ 0001h
LCDDATA15_SEG31COM1_MASK                 equ 0080h
LCDDATA15_S24C1_POSN                     equ 0000h
LCDDATA15_S24C1_POSITION                 equ 0000h
LCDDATA15_S24C1_SIZE                     equ 0001h
LCDDATA15_S24C1_LENGTH                   equ 0001h
LCDDATA15_S24C1_MASK                     equ 0001h
LCDDATA15_S25C1_POSN                     equ 0001h
LCDDATA15_S25C1_POSITION                 equ 0001h
LCDDATA15_S25C1_SIZE                     equ 0001h
LCDDATA15_S25C1_LENGTH                   equ 0001h
LCDDATA15_S25C1_MASK                     equ 0002h
LCDDATA15_S26C1_POSN                     equ 0002h
LCDDATA15_S26C1_POSITION                 equ 0002h
LCDDATA15_S26C1_SIZE                     equ 0001h
LCDDATA15_S26C1_LENGTH                   equ 0001h
LCDDATA15_S26C1_MASK                     equ 0004h
LCDDATA15_S27C1_POSN                     equ 0003h
LCDDATA15_S27C1_POSITION                 equ 0003h
LCDDATA15_S27C1_SIZE                     equ 0001h
LCDDATA15_S27C1_LENGTH                   equ 0001h
LCDDATA15_S27C1_MASK                     equ 0008h
LCDDATA15_S28C1_POSN                     equ 0004h
LCDDATA15_S28C1_POSITION                 equ 0004h
LCDDATA15_S28C1_SIZE                     equ 0001h
LCDDATA15_S28C1_LENGTH                   equ 0001h
LCDDATA15_S28C1_MASK                     equ 0010h
LCDDATA15_S29C1_POSN                     equ 0005h
LCDDATA15_S29C1_POSITION                 equ 0005h
LCDDATA15_S29C1_SIZE                     equ 0001h
LCDDATA15_S29C1_LENGTH                   equ 0001h
LCDDATA15_S29C1_MASK                     equ 0020h
LCDDATA15_S30C1_POSN                     equ 0006h
LCDDATA15_S30C1_POSITION                 equ 0006h
LCDDATA15_S30C1_SIZE                     equ 0001h
LCDDATA15_S30C1_LENGTH                   equ 0001h
LCDDATA15_S30C1_MASK                     equ 0040h
LCDDATA15_S31C1_POSN                     equ 0007h
LCDDATA15_S31C1_POSITION                 equ 0007h
LCDDATA15_S31C1_SIZE                     equ 0001h
LCDDATA15_S31C1_LENGTH                   equ 0001h
LCDDATA15_S31C1_MASK                     equ 0080h

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
LCDDATA16                                equ 0194h
// bitfield definitions
LCDDATA16_SEG32_POSN                     equ 0000h
LCDDATA16_SEG32_POSITION                 equ 0000h
LCDDATA16_SEG32_SIZE                     equ 0001h
LCDDATA16_SEG32_LENGTH                   equ 0001h
LCDDATA16_SEG32_MASK                     equ 0001h
LCDDATA16_SEG33_POSN                     equ 0001h
LCDDATA16_SEG33_POSITION                 equ 0001h
LCDDATA16_SEG33_SIZE                     equ 0001h
LCDDATA16_SEG33_LENGTH                   equ 0001h
LCDDATA16_SEG33_MASK                     equ 0002h
LCDDATA16_SEG34_POSN                     equ 0002h
LCDDATA16_SEG34_POSITION                 equ 0002h
LCDDATA16_SEG34_SIZE                     equ 0001h
LCDDATA16_SEG34_LENGTH                   equ 0001h
LCDDATA16_SEG34_MASK                     equ 0004h
LCDDATA16_SEG35_POSN                     equ 0003h
LCDDATA16_SEG35_POSITION                 equ 0003h
LCDDATA16_SEG35_SIZE                     equ 0001h
LCDDATA16_SEG35_LENGTH                   equ 0001h
LCDDATA16_SEG35_MASK                     equ 0008h
LCDDATA16_SEG36_POSN                     equ 0004h
LCDDATA16_SEG36_POSITION                 equ 0004h
LCDDATA16_SEG36_SIZE                     equ 0001h
LCDDATA16_SEG36_LENGTH                   equ 0001h
LCDDATA16_SEG36_MASK                     equ 0010h
LCDDATA16_SEG37_POSN                     equ 0005h
LCDDATA16_SEG37_POSITION                 equ 0005h
LCDDATA16_SEG37_SIZE                     equ 0001h
LCDDATA16_SEG37_LENGTH                   equ 0001h
LCDDATA16_SEG37_MASK                     equ 0020h
LCDDATA16_SEG38_POSN                     equ 0006h
LCDDATA16_SEG38_POSITION                 equ 0006h
LCDDATA16_SEG38_SIZE                     equ 0001h
LCDDATA16_SEG38_LENGTH                   equ 0001h
LCDDATA16_SEG38_MASK                     equ 0040h
LCDDATA16_SEG39_POSN                     equ 0007h
LCDDATA16_SEG39_POSITION                 equ 0007h
LCDDATA16_SEG39_SIZE                     equ 0001h
LCDDATA16_SEG39_LENGTH                   equ 0001h
LCDDATA16_SEG39_MASK                     equ 0080h
LCDDATA16_SEG32COM1_POSN                 equ 0000h
LCDDATA16_SEG32COM1_POSITION             equ 0000h
LCDDATA16_SEG32COM1_SIZE                 equ 0001h
LCDDATA16_SEG32COM1_LENGTH               equ 0001h
LCDDATA16_SEG32COM1_MASK                 equ 0001h
LCDDATA16_SEG33COM1_POSN                 equ 0001h
LCDDATA16_SEG33COM1_POSITION             equ 0001h
LCDDATA16_SEG33COM1_SIZE                 equ 0001h
LCDDATA16_SEG33COM1_LENGTH               equ 0001h
LCDDATA16_SEG33COM1_MASK                 equ 0002h
LCDDATA16_SEG34COM1_POSN                 equ 0002h
LCDDATA16_SEG34COM1_POSITION             equ 0002h
LCDDATA16_SEG34COM1_SIZE                 equ 0001h
LCDDATA16_SEG34COM1_LENGTH               equ 0001h
LCDDATA16_SEG34COM1_MASK                 equ 0004h
LCDDATA16_SEG35COM1_POSN                 equ 0003h
LCDDATA16_SEG35COM1_POSITION             equ 0003h
LCDDATA16_SEG35COM1_SIZE                 equ 0001h
LCDDATA16_SEG35COM1_LENGTH               equ 0001h
LCDDATA16_SEG35COM1_MASK                 equ 0008h
LCDDATA16_SEG36COM1_POSN                 equ 0004h
LCDDATA16_SEG36COM1_POSITION             equ 0004h
LCDDATA16_SEG36COM1_SIZE                 equ 0001h
LCDDATA16_SEG36COM1_LENGTH               equ 0001h
LCDDATA16_SEG36COM1_MASK                 equ 0010h
LCDDATA16_SEG37COM1_POSN                 equ 0005h
LCDDATA16_SEG37COM1_POSITION             equ 0005h
LCDDATA16_SEG37COM1_SIZE                 equ 0001h
LCDDATA16_SEG37COM1_LENGTH               equ 0001h
LCDDATA16_SEG37COM1_MASK                 equ 0020h
LCDDATA16_SEG38COM1_POSN                 equ 0006h
LCDDATA16_SEG38COM1_POSITION             equ 0006h
LCDDATA16_SEG38COM1_SIZE                 equ 0001h
LCDDATA16_SEG38COM1_LENGTH               equ 0001h
LCDDATA16_SEG38COM1_MASK                 equ 0040h
LCDDATA16_SEG39COM1_POSN                 equ 0007h
LCDDATA16_SEG39COM1_POSITION             equ 0007h
LCDDATA16_SEG39COM1_SIZE                 equ 0001h
LCDDATA16_SEG39COM1_LENGTH               equ 0001h
LCDDATA16_SEG39COM1_MASK                 equ 0080h
LCDDATA16_S32C1_POSN                     equ 0000h
LCDDATA16_S32C1_POSITION                 equ 0000h
LCDDATA16_S32C1_SIZE                     equ 0001h
LCDDATA16_S32C1_LENGTH                   equ 0001h
LCDDATA16_S32C1_MASK                     equ 0001h
LCDDATA16_S33C1_POSN                     equ 0001h
LCDDATA16_S33C1_POSITION                 equ 0001h
LCDDATA16_S33C1_SIZE                     equ 0001h
LCDDATA16_S33C1_LENGTH                   equ 0001h
LCDDATA16_S33C1_MASK                     equ 0002h
LCDDATA16_S34C1_POSN                     equ 0002h
LCDDATA16_S34C1_POSITION                 equ 0002h
LCDDATA16_S34C1_SIZE                     equ 0001h
LCDDATA16_S34C1_LENGTH                   equ 0001h
LCDDATA16_S34C1_MASK                     equ 0004h
LCDDATA16_S35C1_POSN                     equ 0003h
LCDDATA16_S35C1_POSITION                 equ 0003h
LCDDATA16_S35C1_SIZE                     equ 0001h
LCDDATA16_S35C1_LENGTH                   equ 0001h
LCDDATA16_S35C1_MASK                     equ 0008h
LCDDATA16_S36C1_POSN                     equ 0004h
LCDDATA16_S36C1_POSITION                 equ 0004h
LCDDATA16_S36C1_SIZE                     equ 0001h
LCDDATA16_S36C1_LENGTH                   equ 0001h
LCDDATA16_S36C1_MASK                     equ 0010h
LCDDATA16_S37C1_POSN                     equ 0005h
LCDDATA16_S37C1_POSITION                 equ 0005h
LCDDATA16_S37C1_SIZE                     equ 0001h
LCDDATA16_S37C1_LENGTH                   equ 0001h
LCDDATA16_S37C1_MASK                     equ 0020h
LCDDATA16_S38C1_POSN                     equ 0006h
LCDDATA16_S38C1_POSITION                 equ 0006h
LCDDATA16_S38C1_SIZE                     equ 0001h
LCDDATA16_S38C1_LENGTH                   equ 0001h
LCDDATA16_S38C1_MASK                     equ 0040h
LCDDATA16_S39C1_POSN                     equ 0007h
LCDDATA16_S39C1_POSITION                 equ 0007h
LCDDATA16_S39C1_SIZE                     equ 0001h
LCDDATA16_S39C1_LENGTH                   equ 0001h
LCDDATA16_S39C1_MASK                     equ 0080h

