GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
// Register: LCDDATA17
#define LCDDATA17 LCDDATA17
LCDDATA17                                equ 0195h
// bitfield definitions
LCDDATA17_SEG40_POSN                     equ 0000h
LCDDATA17_SEG40_POSITION                 equ 0000h
LCDDATA17_SEG40_SIZE                     equ 0001h
LCDDATA17_SEG40_LENGTH                   equ 0001h
LCDDATA17_SEG40_MASK                     equ 0001h
LCDDATA17_SEG41_POSN                     equ 0001h
LCDDATA17_SEG41_POSITION                 equ 0001h
LCDDATA17_SEG41_SIZE                     equ 0001h
LCDDATA17_SEG41_LENGTH                   equ 0001h
LCDDATA17_SEG41_MASK                     equ 0002h
LCDDATA17_SEG40COM1_POSN                 equ 0000h
LCDDATA17_SEG40COM1_POSITION             equ 0000h
LCDDATA17_SEG40COM1_SIZE                 equ 0001h
LCDDATA17_SEG40COM1_LENGTH               equ 0001h
LCDDATA17_SEG40COM1_MASK                 equ 0001h
LCDDATA17_SEG41COM1_POSN                 equ 0001h
LCDDATA17_SEG41COM1_POSITION             equ 0001h
LCDDATA17_SEG41COM1_SIZE                 equ 0001h
LCDDATA17_SEG41COM1_LENGTH               equ 0001h
LCDDATA17_SEG41COM1_MASK                 equ 0002h
LCDDATA17_S40C1_POSN                     equ 0000h
LCDDATA17_S40C1_POSITION                 equ 0000h
LCDDATA17_S40C1_SIZE                     equ 0001h
LCDDATA17_S40C1_LENGTH                   equ 0001h
LCDDATA17_S40C1_MASK                     equ 0001h
LCDDATA17_S41C1_POSN                     equ 0001h
LCDDATA17_S41C1_POSITION                 equ 0001h
LCDDATA17_S41C1_SIZE                     equ 0001h
LCDDATA17_S41C1_LENGTH                   equ 0001h
LCDDATA17_S41C1_MASK                     equ 0002h

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
LCDDATA18                                equ 0196h
// bitfield definitions
LCDDATA18_SEG24_POSN                     equ 0000h
LCDDATA18_SEG24_POSITION                 equ 0000h
LCDDATA18_SEG24_SIZE                     equ 0001h
LCDDATA18_SEG24_LENGTH                   equ 0001h
LCDDATA18_SEG24_MASK                     equ 0001h
LCDDATA18_SEG25_POSN                     equ 0001h
LCDDATA18_SEG25_POSITION                 equ 0001h
LCDDATA18_SEG25_SIZE                     equ 0001h
LCDDATA18_SEG25_LENGTH                   equ 0001h
LCDDATA18_SEG25_MASK                     equ 0002h
LCDDATA18_SEG26_POSN                     equ 0002h
LCDDATA18_SEG26_POSITION                 equ 0002h
LCDDATA18_SEG26_SIZE                     equ 0001h
LCDDATA18_SEG26_LENGTH                   equ 0001h
LCDDATA18_SEG26_MASK                     equ 0004h
LCDDATA18_SEG27_POSN                     equ 0003h
LCDDATA18_SEG27_POSITION                 equ 0003h
LCDDATA18_SEG27_SIZE                     equ 0001h
LCDDATA18_SEG27_LENGTH                   equ 0001h
LCDDATA18_SEG27_MASK                     equ 0008h
LCDDATA18_SEG28_POSN                     equ 0004h
LCDDATA18_SEG28_POSITION                 equ 0004h
LCDDATA18_SEG28_SIZE                     equ 0001h
LCDDATA18_SEG28_LENGTH                   equ 0001h
LCDDATA18_SEG28_MASK                     equ 0010h
LCDDATA18_SEG29_POSN                     equ 0005h
LCDDATA18_SEG29_POSITION                 equ 0005h
LCDDATA18_SEG29_SIZE                     equ 0001h
LCDDATA18_SEG29_LENGTH                   equ 0001h
LCDDATA18_SEG29_MASK                     equ 0020h
LCDDATA18_SEG30_POSN                     equ 0006h
LCDDATA18_SEG30_POSITION                 equ 0006h
LCDDATA18_SEG30_SIZE                     equ 0001h
LCDDATA18_SEG30_LENGTH                   equ 0001h
LCDDATA18_SEG30_MASK                     equ 0040h
LCDDATA18_SEG31_POSN                     equ 0007h
LCDDATA18_SEG31_POSITION                 equ 0007h
LCDDATA18_SEG31_SIZE                     equ 0001h
LCDDATA18_SEG31_LENGTH                   equ 0001h
LCDDATA18_SEG31_MASK                     equ 0080h
LCDDATA18_SEG24COM2_POSN                 equ 0000h
LCDDATA18_SEG24COM2_POSITION             equ 0000h
LCDDATA18_SEG24COM2_SIZE                 equ 0001h
LCDDATA18_SEG24COM2_LENGTH               equ 0001h
LCDDATA18_SEG24COM2_MASK                 equ 0001h
LCDDATA18_SEG25COM2_POSN                 equ 0001h
LCDDATA18_SEG25COM2_POSITION             equ 0001h
LCDDATA18_SEG25COM2_SIZE                 equ 0001h
LCDDATA18_SEG25COM2_LENGTH               equ 0001h
LCDDATA18_SEG25COM2_MASK                 equ 0002h
LCDDATA18_SEG26COM2_POSN                 equ 0002h
LCDDATA18_SEG26COM2_POSITION             equ 0002h
LCDDATA18_SEG26COM2_SIZE                 equ 0001h
LCDDATA18_SEG26COM2_LENGTH               equ 0001h
LCDDATA18_SEG26COM2_MASK                 equ 0004h
LCDDATA18_SEG27COM2_POSN                 equ 0003h
LCDDATA18_SEG27COM2_POSITION             equ 0003h
LCDDATA18_SEG27COM2_SIZE                 equ 0001h
LCDDATA18_SEG27COM2_LENGTH               equ 0001h
LCDDATA18_SEG27COM2_MASK                 equ 0008h
LCDDATA18_SEG28COM2_POSN                 equ 0004h
LCDDATA18_SEG28COM2_POSITION             equ 0004h
LCDDATA18_SEG28COM2_SIZE                 equ 0001h
LCDDATA18_SEG28COM2_LENGTH               equ 0001h
LCDDATA18_SEG28COM2_MASK                 equ 0010h
LCDDATA18_SEG29COM2_POSN                 equ 0005h
LCDDATA18_SEG29COM2_POSITION             equ 0005h
LCDDATA18_SEG29COM2_SIZE                 equ 0001h
LCDDATA18_SEG29COM2_LENGTH               equ 0001h
LCDDATA18_SEG29COM2_MASK                 equ 0020h
LCDDATA18_SEG30COM2_POSN                 equ 0006h
LCDDATA18_SEG30COM2_POSITION             equ 0006h
LCDDATA18_SEG30COM2_SIZE                 equ 0001h
LCDDATA18_SEG30COM2_LENGTH               equ 0001h
LCDDATA18_SEG30COM2_MASK                 equ 0040h
LCDDATA18_SEG31COM2_POSN                 equ 0007h
LCDDATA18_SEG31COM2_POSITION             equ 0007h
LCDDATA18_SEG31COM2_SIZE                 equ 0001h
LCDDATA18_SEG31COM2_LENGTH               equ 0001h
LCDDATA18_SEG31COM2_MASK                 equ 0080h
LCDDATA18_S24C2_POSN                     equ 0000h
LCDDATA18_S24C2_POSITION                 equ 0000h
LCDDATA18_S24C2_SIZE                     equ 0001h
LCDDATA18_S24C2_LENGTH                   equ 0001h
LCDDATA18_S24C2_MASK                     equ 0001h
LCDDATA18_S25C2_POSN                     equ 0001h
LCDDATA18_S25C2_POSITION                 equ 0001h
LCDDATA18_S25C2_SIZE                     equ 0001h
LCDDATA18_S25C2_LENGTH                   equ 0001h
LCDDATA18_S25C2_MASK                     equ 0002h
LCDDATA18_S26C2_POSN                     equ 0002h
LCDDATA18_S26C2_POSITION                 equ 0002h
LCDDATA18_S26C2_SIZE                     equ 0001h
LCDDATA18_S26C2_LENGTH                   equ 0001h
LCDDATA18_S26C2_MASK                     equ 0004h
LCDDATA18_S27C2_POSN                     equ 0003h
LCDDATA18_S27C2_POSITION                 equ 0003h
LCDDATA18_S27C2_SIZE                     equ 0001h
LCDDATA18_S27C2_LENGTH                   equ 0001h
LCDDATA18_S27C2_MASK                     equ 0008h
LCDDATA18_S28C2_POSN                     equ 0004h
LCDDATA18_S28C2_POSITION                 equ 0004h
LCDDATA18_S28C2_SIZE                     equ 0001h
LCDDATA18_S28C2_LENGTH                   equ 0001h
LCDDATA18_S28C2_MASK                     equ 0010h
LCDDATA18_S29C2_POSN                     equ 0005h
LCDDATA18_S29C2_POSITION                 equ 0005h
LCDDATA18_S29C2_SIZE                     equ 0001h
LCDDATA18_S29C2_LENGTH                   equ 0001h
LCDDATA18_S29C2_MASK                     equ 0020h
LCDDATA18_S30C2_POSN                     equ 0006h
LCDDATA18_S30C2_POSITION                 equ 0006h
LCDDATA18_S30C2_SIZE                     equ 0001h
LCDDATA18_S30C2_LENGTH                   equ 0001h
LCDDATA18_S30C2_MASK                     equ 0040h
LCDDATA18_S31C2_POSN                     equ 0007h
LCDDATA18_S31C2_POSITION                 equ 0007h
LCDDATA18_S31C2_SIZE                     equ 0001h
LCDDATA18_S31C2_LENGTH                   equ 0001h
LCDDATA18_S31C2_MASK                     equ 0080h

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
LCDDATA19                                equ 0197h
// bitfield definitions
LCDDATA19_SEG32_POSN                     equ 0000h
LCDDATA19_SEG32_POSITION                 equ 0000h
LCDDATA19_SEG32_SIZE                     equ 0001h
LCDDATA19_SEG32_LENGTH                   equ 0001h
LCDDATA19_SEG32_MASK                     equ 0001h
LCDDATA19_SEG33_POSN                     equ 0001h
LCDDATA19_SEG33_POSITION                 equ 0001h
LCDDATA19_SEG33_SIZE                     equ 0001h
LCDDATA19_SEG33_LENGTH                   equ 0001h
LCDDATA19_SEG33_MASK                     equ 0002h
LCDDATA19_SEG34_POSN                     equ 0002h
LCDDATA19_SEG34_POSITION                 equ 0002h
LCDDATA19_SEG34_SIZE                     equ 0001h
LCDDATA19_SEG34_LENGTH                   equ 0001h
LCDDATA19_SEG34_MASK                     equ 0004h
LCDDATA19_SEG35_POSN                     equ 0003h
LCDDATA19_SEG35_POSITION                 equ 0003h
LCDDATA19_SEG35_SIZE                     equ 0001h
LCDDATA19_SEG35_LENGTH                   equ 0001h
LCDDATA19_SEG35_MASK                     equ 0008h
LCDDATA19_SEG36_POSN                     equ 0004h
LCDDATA19_SEG36_POSITION                 equ 0004h
LCDDATA19_SEG36_SIZE                     equ 0001h
LCDDATA19_SEG36_LENGTH                   equ 0001h
LCDDATA19_SEG36_MASK                     equ 0010h
LCDDATA19_SEG37_POSN                     equ 0005h
LCDDATA19_SEG37_POSITION                 equ 0005h
LCDDATA19_SEG37_SIZE                     equ 0001h
LCDDATA19_SEG37_LENGTH                   equ 0001h
LCDDATA19_SEG37_MASK                     equ 0020h
LCDDATA19_SEG38_POSN                     equ 0006h
LCDDATA19_SEG38_POSITION                 equ 0006h
LCDDATA19_SEG38_SIZE                     equ 0001h
LCDDATA19_SEG38_LENGTH                   equ 0001h
LCDDATA19_SEG38_MASK                     equ 0040h
LCDDATA19_SEG39_POSN                     equ 0007h
LCDDATA19_SEG39_POSITION                 equ 0007h
LCDDATA19_SEG39_SIZE                     equ 0001h
LCDDATA19_SEG39_LENGTH                   equ 0001h
LCDDATA19_SEG39_MASK                     equ 0080h
LCDDATA19_SEG32COM2_POSN                 equ 0000h
LCDDATA19_SEG32COM2_POSITION             equ 0000h
LCDDATA19_SEG32COM2_SIZE                 equ 0001h
LCDDATA19_SEG32COM2_LENGTH               equ 0001h
LCDDATA19_SEG32COM2_MASK                 equ 0001h
LCDDATA19_SEG33COM2_POSN                 equ 0001h
LCDDATA19_SEG33COM2_POSITION             equ 0001h
LCDDATA19_SEG33COM2_SIZE                 equ 0001h
LCDDATA19_SEG33COM2_LENGTH               equ 0001h
LCDDATA19_SEG33COM2_MASK                 equ 0002h
LCDDATA19_SEG34COM2_POSN                 equ 0002h
LCDDATA19_SEG34COM2_POSITION             equ 0002h
LCDDATA19_SEG34COM2_SIZE                 equ 0001h
LCDDATA19_SEG34COM2_LENGTH               equ 0001h
LCDDATA19_SEG34COM2_MASK                 equ 0004h
LCDDATA19_SEG35COM2_POSN                 equ 0003h
LCDDATA19_SEG35COM2_POSITION             equ 0003h
LCDDATA19_SEG35COM2_SIZE                 equ 0001h
LCDDATA19_SEG35COM2_LENGTH               equ 0001h
LCDDATA19_SEG35COM2_MASK                 equ 0008h
LCDDATA19_SEG36COM2_POSN                 equ 0004h
LCDDATA19_SEG36COM2_POSITION             equ 0004h
LCDDATA19_SEG36COM2_SIZE                 equ 0001h
LCDDATA19_SEG36COM2_LENGTH               equ 0001h
LCDDATA19_SEG36COM2_MASK                 equ 0010h
LCDDATA19_SEG37COM2_POSN                 equ 0005h
LCDDATA19_SEG37COM2_POSITION             equ 0005h
LCDDATA19_SEG37COM2_SIZE                 equ 0001h
LCDDATA19_SEG37COM2_LENGTH               equ 0001h
LCDDATA19_SEG37COM2_MASK                 equ 0020h
LCDDATA19_SEG38COM2_POSN                 equ 0006h
LCDDATA19_SEG38COM2_POSITION             equ 0006h
LCDDATA19_SEG38COM2_SIZE                 equ 0001h
LCDDATA19_SEG38COM2_LENGTH               equ 0001h
LCDDATA19_SEG38COM2_MASK                 equ 0040h
LCDDATA19_SEG39COM2_POSN                 equ 0007h
LCDDATA19_SEG39COM2_POSITION             equ 0007h
LCDDATA19_SEG39COM2_SIZE                 equ 0001h
LCDDATA19_SEG39COM2_LENGTH               equ 0001h
LCDDATA19_SEG39COM2_MASK                 equ 0080h
LCDDATA19_S32C2_POSN                     equ 0000h
LCDDATA19_S32C2_POSITION                 equ 0000h
LCDDATA19_S32C2_SIZE                     equ 0001h
LCDDATA19_S32C2_LENGTH                   equ 0001h
LCDDATA19_S32C2_MASK                     equ 0001h
LCDDATA19_S33C2_POSN                     equ 0001h
LCDDATA19_S33C2_POSITION                 equ 0001h
LCDDATA19_S33C2_SIZE                     equ 0001h
LCDDATA19_S33C2_LENGTH                   equ 0001h
LCDDATA19_S33C2_MASK                     equ 0002h
LCDDATA19_S34C2_POSN                     equ 0002h
LCDDATA19_S34C2_POSITION                 equ 0002h
LCDDATA19_S34C2_SIZE                     equ 0001h
LCDDATA19_S34C2_LENGTH                   equ 0001h
LCDDATA19_S34C2_MASK                     equ 0004h
LCDDATA19_S35C2_POSN                     equ 0003h
LCDDATA19_S35C2_POSITION                 equ 0003h
LCDDATA19_S35C2_SIZE                     equ 0001h
LCDDATA19_S35C2_LENGTH                   equ 0001h
LCDDATA19_S35C2_MASK                     equ 0008h
LCDDATA19_S36C2_POSN                     equ 0004h
LCDDATA19_S36C2_POSITION                 equ 0004h
LCDDATA19_S36C2_SIZE                     equ 0001h
LCDDATA19_S36C2_LENGTH                   equ 0001h
LCDDATA19_S36C2_MASK                     equ 0010h
LCDDATA19_S37C2_POSN                     equ 0005h
LCDDATA19_S37C2_POSITION                 equ 0005h
LCDDATA19_S37C2_SIZE                     equ 0001h
LCDDATA19_S37C2_LENGTH                   equ 0001h
LCDDATA19_S37C2_MASK                     equ 0020h
LCDDATA19_S38C2_POSN                     equ 0006h
LCDDATA19_S38C2_POSITION                 equ 0006h
LCDDATA19_S38C2_SIZE                     equ 0001h
LCDDATA19_S38C2_LENGTH                   equ 0001h
LCDDATA19_S38C2_MASK                     equ 0040h
LCDDATA19_S39C2_POSN                     equ 0007h
LCDDATA19_S39C2_POSITION                 equ 0007h
LCDDATA19_S39C2_SIZE                     equ 0001h
LCDDATA19_S39C2_LENGTH                   equ 0001h
LCDDATA19_S39C2_MASK                     equ 0080h

