GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
LCDDATA20                                equ 0198h
// bitfield definitions
LCDDATA20_SEG40_POSN                     equ 0000h
LCDDATA20_SEG40_POSITION                 equ 0000h
LCDDATA20_SEG40_SIZE                     equ 0001h
LCDDATA20_SEG40_LENGTH                   equ 0001h
LCDDATA20_SEG40_MASK                     equ 0001h
LCDDATA20_SEG41_POSN                     equ 0001h
LCDDATA20_SEG41_POSITION                 equ 0001h
LCDDATA20_SEG41_SIZE                     equ 0001h
LCDDATA20_SEG41_LENGTH                   equ 0001h
LCDDATA20_SEG41_MASK                     equ 0002h
LCDDATA20_SEG40COM2_POSN                 equ 0000h
LCDDATA20_SEG40COM2_POSITION             equ 0000h
LCDDATA20_SEG40COM2_SIZE                 equ 0001h
LCDDATA20_SEG40COM2_LENGTH               equ 0001h
LCDDATA20_SEG40COM2_MASK                 equ 0001h
LCDDATA20_SEG41COM2_POSN                 equ 0001h
LCDDATA20_SEG41COM2_POSITION             equ 0001h
LCDDATA20_SEG41COM2_SIZE                 equ 0001h
LCDDATA20_SEG41COM2_LENGTH               equ 0001h
LCDDATA20_SEG41COM2_MASK                 equ 0002h
LCDDATA20_S40C2_POSN                     equ 0000h
LCDDATA20_S40C2_POSITION                 equ 0000h
LCDDATA20_S40C2_SIZE                     equ 0001h
LCDDATA20_S40C2_LENGTH                   equ 0001h
LCDDATA20_S40C2_MASK                     equ 0001h
LCDDATA20_S41C2_POSN                     equ 0001h
LCDDATA20_S41C2_POSITION                 equ 0001h
LCDDATA20_S41C2_SIZE                     equ 0001h
LCDDATA20_S41C2_LENGTH                   equ 0001h
LCDDATA20_S41C2_MASK                     equ 0002h

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
LCDDATA21                                equ 0199h
// bitfield definitions
LCDDATA21_SEG24_POSN                     equ 0000h
LCDDATA21_SEG24_POSITION                 equ 0000h
LCDDATA21_SEG24_SIZE                     equ 0001h
LCDDATA21_SEG24_LENGTH                   equ 0001h
LCDDATA21_SEG24_MASK                     equ 0001h
LCDDATA21_SEG25_POSN                     equ 0001h
LCDDATA21_SEG25_POSITION                 equ 0001h
LCDDATA21_SEG25_SIZE                     equ 0001h
LCDDATA21_SEG25_LENGTH                   equ 0001h
LCDDATA21_SEG25_MASK                     equ 0002h
LCDDATA21_SEG26_POSN                     equ 0002h
LCDDATA21_SEG26_POSITION                 equ 0002h
LCDDATA21_SEG26_SIZE                     equ 0001h
LCDDATA21_SEG26_LENGTH                   equ 0001h
LCDDATA21_SEG26_MASK                     equ 0004h
LCDDATA21_SEG27_POSN                     equ 0003h
LCDDATA21_SEG27_POSITION                 equ 0003h
LCDDATA21_SEG27_SIZE                     equ 0001h
LCDDATA21_SEG27_LENGTH                   equ 0001h
LCDDATA21_SEG27_MASK                     equ 0008h
LCDDATA21_SEG28_POSN                     equ 0004h
LCDDATA21_SEG28_POSITION                 equ 0004h
LCDDATA21_SEG28_SIZE                     equ 0001h
LCDDATA21_SEG28_LENGTH                   equ 0001h
LCDDATA21_SEG28_MASK                     equ 0010h
LCDDATA21_SEG29_POSN                     equ 0005h
LCDDATA21_SEG29_POSITION                 equ 0005h
LCDDATA21_SEG29_SIZE                     equ 0001h
LCDDATA21_SEG29_LENGTH                   equ 0001h
LCDDATA21_SEG29_MASK                     equ 0020h
LCDDATA21_SEG30_POSN                     equ 0006h
LCDDATA21_SEG30_POSITION                 equ 0006h
LCDDATA21_SEG30_SIZE                     equ 0001h
LCDDATA21_SEG30_LENGTH                   equ 0001h
LCDDATA21_SEG30_MASK                     equ 0040h
LCDDATA21_SEG31_POSN                     equ 0007h
LCDDATA21_SEG31_POSITION                 equ 0007h
LCDDATA21_SEG31_SIZE                     equ 0001h
LCDDATA21_SEG31_LENGTH                   equ 0001h
LCDDATA21_SEG31_MASK                     equ 0080h
LCDDATA21_SEG24COM3_POSN                 equ 0000h
LCDDATA21_SEG24COM3_POSITION             equ 0000h
LCDDATA21_SEG24COM3_SIZE                 equ 0001h
LCDDATA21_SEG24COM3_LENGTH               equ 0001h
LCDDATA21_SEG24COM3_MASK                 equ 0001h
LCDDATA21_SEG25COM3_POSN                 equ 0001h
LCDDATA21_SEG25COM3_POSITION             equ 0001h
LCDDATA21_SEG25COM3_SIZE                 equ 0001h
LCDDATA21_SEG25COM3_LENGTH               equ 0001h
LCDDATA21_SEG25COM3_MASK                 equ 0002h
LCDDATA21_SEG26COM3_POSN                 equ 0002h
LCDDATA21_SEG26COM3_POSITION             equ 0002h
LCDDATA21_SEG26COM3_SIZE                 equ 0001h
LCDDATA21_SEG26COM3_LENGTH               equ 0001h
LCDDATA21_SEG26COM3_MASK                 equ 0004h
LCDDATA21_SEG27COM3_POSN                 equ 0003h
LCDDATA21_SEG27COM3_POSITION             equ 0003h
LCDDATA21_SEG27COM3_SIZE                 equ 0001h
LCDDATA21_SEG27COM3_LENGTH               equ 0001h
LCDDATA21_SEG27COM3_MASK                 equ 0008h
LCDDATA21_SEG28COM3_POSN                 equ 0004h
LCDDATA21_SEG28COM3_POSITION             equ 0004h
LCDDATA21_SEG28COM3_SIZE                 equ 0001h
LCDDATA21_SEG28COM3_LENGTH               equ 0001h
LCDDATA21_SEG28COM3_MASK                 equ 0010h
LCDDATA21_SEG29COM3_POSN                 equ 0005h
LCDDATA21_SEG29COM3_POSITION             equ 0005h
LCDDATA21_SEG29COM3_SIZE                 equ 0001h
LCDDATA21_SEG29COM3_LENGTH               equ 0001h
LCDDATA21_SEG29COM3_MASK                 equ 0020h
LCDDATA21_SEG30COM3_POSN                 equ 0006h
LCDDATA21_SEG30COM3_POSITION             equ 0006h
LCDDATA21_SEG30COM3_SIZE                 equ 0001h
LCDDATA21_SEG30COM3_LENGTH               equ 0001h
LCDDATA21_SEG30COM3_MASK                 equ 0040h
LCDDATA21_SEG31COM3_POSN                 equ 0007h
LCDDATA21_SEG31COM3_POSITION             equ 0007h
LCDDATA21_SEG31COM3_SIZE                 equ 0001h
LCDDATA21_SEG31COM3_LENGTH               equ 0001h
LCDDATA21_SEG31COM3_MASK                 equ 0080h
LCDDATA21_S24C3_POSN                     equ 0000h
LCDDATA21_S24C3_POSITION                 equ 0000h
LCDDATA21_S24C3_SIZE                     equ 0001h
LCDDATA21_S24C3_LENGTH                   equ 0001h
LCDDATA21_S24C3_MASK                     equ 0001h
LCDDATA21_S25C3_POSN                     equ 0001h
LCDDATA21_S25C3_POSITION                 equ 0001h
LCDDATA21_S25C3_SIZE                     equ 0001h
LCDDATA21_S25C3_LENGTH                   equ 0001h
LCDDATA21_S25C3_MASK                     equ 0002h
LCDDATA21_S26C3_POSN                     equ 0002h
LCDDATA21_S26C3_POSITION                 equ 0002h
LCDDATA21_S26C3_SIZE                     equ 0001h
LCDDATA21_S26C3_LENGTH                   equ 0001h
LCDDATA21_S26C3_MASK                     equ 0004h
LCDDATA21_S27C3_POSN                     equ 0003h
LCDDATA21_S27C3_POSITION                 equ 0003h
LCDDATA21_S27C3_SIZE                     equ 0001h
LCDDATA21_S27C3_LENGTH                   equ 0001h
LCDDATA21_S27C3_MASK                     equ 0008h
LCDDATA21_S28C3_POSN                     equ 0004h
LCDDATA21_S28C3_POSITION                 equ 0004h
LCDDATA21_S28C3_SIZE                     equ 0001h
LCDDATA21_S28C3_LENGTH                   equ 0001h
LCDDATA21_S28C3_MASK                     equ 0010h
LCDDATA21_S29C3_POSN                     equ 0005h
LCDDATA21_S29C3_POSITION                 equ 0005h
LCDDATA21_S29C3_SIZE                     equ 0001h
LCDDATA21_S29C3_LENGTH                   equ 0001h
LCDDATA21_S29C3_MASK                     equ 0020h
LCDDATA21_S30C3_POSN                     equ 0006h
LCDDATA21_S30C3_POSITION                 equ 0006h
LCDDATA21_S30C3_SIZE                     equ 0001h
LCDDATA21_S30C3_LENGTH                   equ 0001h
LCDDATA21_S30C3_MASK                     equ 0040h
LCDDATA21_S31C3_POSN                     equ 0007h
LCDDATA21_S31C3_POSITION                 equ 0007h
LCDDATA21_S31C3_SIZE                     equ 0001h
LCDDATA21_S31C3_LENGTH                   equ 0001h
LCDDATA21_S31C3_MASK                     equ 0080h

