GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
// Register: LCDDATA22
#define LCDDATA22 LCDDATA22
LCDDATA22                                equ 019Ah
// bitfield definitions
LCDDATA22_SEG32_POSN                     equ 0000h
LCDDATA22_SEG32_POSITION                 equ 0000h
LCDDATA22_SEG32_SIZE                     equ 0001h
LCDDATA22_SEG32_LENGTH                   equ 0001h
LCDDATA22_SEG32_MASK                     equ 0001h
LCDDATA22_SEG33_POSN                     equ 0001h
LCDDATA22_SEG33_POSITION                 equ 0001h
LCDDATA22_SEG33_SIZE                     equ 0001h
LCDDATA22_SEG33_LENGTH                   equ 0001h
LCDDATA22_SEG33_MASK                     equ 0002h
LCDDATA22_SEG34_POSN                     equ 0002h
LCDDATA22_SEG34_POSITION                 equ 0002h
LCDDATA22_SEG34_SIZE                     equ 0001h
LCDDATA22_SEG34_LENGTH                   equ 0001h
LCDDATA22_SEG34_MASK                     equ 0004h
LCDDATA22_SEG35_POSN                     equ 0003h
LCDDATA22_SEG35_POSITION                 equ 0003h
LCDDATA22_SEG35_SIZE                     equ 0001h
LCDDATA22_SEG35_LENGTH                   equ 0001h
LCDDATA22_SEG35_MASK                     equ 0008h
LCDDATA22_SEG36_POSN                     equ 0004h
LCDDATA22_SEG36_POSITION                 equ 0004h
LCDDATA22_SEG36_SIZE                     equ 0001h
LCDDATA22_SEG36_LENGTH                   equ 0001h
LCDDATA22_SEG36_MASK                     equ 0010h
LCDDATA22_SEG37_POSN                     equ 0005h
LCDDATA22_SEG37_POSITION                 equ 0005h
LCDDATA22_SEG37_SIZE                     equ 0001h
LCDDATA22_SEG37_LENGTH                   equ 0001h
LCDDATA22_SEG37_MASK                     equ 0020h
LCDDATA22_SEG38_POSN                     equ 0006h
LCDDATA22_SEG38_POSITION                 equ 0006h
LCDDATA22_SEG38_SIZE                     equ 0001h
LCDDATA22_SEG38_LENGTH                   equ 0001h
LCDDATA22_SEG38_MASK                     equ 0040h
LCDDATA22_SEG39_POSN                     equ 0007h
LCDDATA22_SEG39_POSITION                 equ 0007h
LCDDATA22_SEG39_SIZE                     equ 0001h
LCDDATA22_SEG39_LENGTH                   equ 0001h
LCDDATA22_SEG39_MASK                     equ 0080h
LCDDATA22_SEG32COM3_POSN                 equ 0000h
LCDDATA22_SEG32COM3_POSITION             equ 0000h
LCDDATA22_SEG32COM3_SIZE                 equ 0001h
LCDDATA22_SEG32COM3_LENGTH               equ 0001h
LCDDATA22_SEG32COM3_MASK                 equ 0001h
LCDDATA22_SEG33COM3_POSN                 equ 0001h
LCDDATA22_SEG33COM3_POSITION             equ 0001h
LCDDATA22_SEG33COM3_SIZE                 equ 0001h
LCDDATA22_SEG33COM3_LENGTH               equ 0001h
LCDDATA22_SEG33COM3_MASK                 equ 0002h
LCDDATA22_SEG34COM3_POSN                 equ 0002h
LCDDATA22_SEG34COM3_POSITION             equ 0002h
LCDDATA22_SEG34COM3_SIZE                 equ 0001h
LCDDATA22_SEG34COM3_LENGTH               equ 0001h
LCDDATA22_SEG34COM3_MASK                 equ 0004h
LCDDATA22_SEG35COM3_POSN                 equ 0003h
LCDDATA22_SEG35COM3_POSITION             equ 0003h
LCDDATA22_SEG35COM3_SIZE                 equ 0001h
LCDDATA22_SEG35COM3_LENGTH               equ 0001h
LCDDATA22_SEG35COM3_MASK                 equ 0008h
LCDDATA22_SEG36COM3_POSN                 equ 0004h
LCDDATA22_SEG36COM3_POSITION             equ 0004h
LCDDATA22_SEG36COM3_SIZE                 equ 0001h
LCDDATA22_SEG36COM3_LENGTH               equ 0001h
LCDDATA22_SEG36COM3_MASK                 equ 0010h
LCDDATA22_SEG37COM3_POSN                 equ 0005h
LCDDATA22_SEG37COM3_POSITION             equ 0005h
LCDDATA22_SEG37COM3_SIZE                 equ 0001h
LCDDATA22_SEG37COM3_LENGTH               equ 0001h
LCDDATA22_SEG37COM3_MASK                 equ 0020h
LCDDATA22_SEG38COM3_POSN                 equ 0006h
LCDDATA22_SEG38COM3_POSITION             equ 0006h
LCDDATA22_SEG38COM3_SIZE                 equ 0001h
LCDDATA22_SEG38COM3_LENGTH               equ 0001h
LCDDATA22_SEG38COM3_MASK                 equ 0040h
LCDDATA22_SEG39COM3_POSN                 equ 0007h
LCDDATA22_SEG39COM3_POSITION             equ 0007h
LCDDATA22_SEG39COM3_SIZE                 equ 0001h
LCDDATA22_SEG39COM3_LENGTH               equ 0001h
LCDDATA22_SEG39COM3_MASK                 equ 0080h
LCDDATA22_S32C3_POSN                     equ 0000h
LCDDATA22_S32C3_POSITION                 equ 0000h
LCDDATA22_S32C3_SIZE                     equ 0001h
LCDDATA22_S32C3_LENGTH                   equ 0001h
LCDDATA22_S32C3_MASK                     equ 0001h
LCDDATA22_S33C3_POSN                     equ 0001h
LCDDATA22_S33C3_POSITION                 equ 0001h
LCDDATA22_S33C3_SIZE                     equ 0001h
LCDDATA22_S33C3_LENGTH                   equ 0001h
LCDDATA22_S33C3_MASK                     equ 0002h
LCDDATA22_S34C3_POSN                     equ 0002h
LCDDATA22_S34C3_POSITION                 equ 0002h
LCDDATA22_S34C3_SIZE                     equ 0001h
LCDDATA22_S34C3_LENGTH                   equ 0001h
LCDDATA22_S34C3_MASK                     equ 0004h
LCDDATA22_S35C3_POSN                     equ 0003h
LCDDATA22_S35C3_POSITION                 equ 0003h
LCDDATA22_S35C3_SIZE                     equ 0001h
LCDDATA22_S35C3_LENGTH                   equ 0001h
LCDDATA22_S35C3_MASK                     equ 0008h
LCDDATA22_S36C3_POSN                     equ 0004h
LCDDATA22_S36C3_POSITION                 equ 0004h
LCDDATA22_S36C3_SIZE                     equ 0001h
LCDDATA22_S36C3_LENGTH                   equ 0001h
LCDDATA22_S36C3_MASK                     equ 0010h
LCDDATA22_S37C3_POSN                     equ 0005h
LCDDATA22_S37C3_POSITION                 equ 0005h
LCDDATA22_S37C3_SIZE                     equ 0001h
LCDDATA22_S37C3_LENGTH                   equ 0001h
LCDDATA22_S37C3_MASK                     equ 0020h
LCDDATA22_S38C3_POSN                     equ 0006h
LCDDATA22_S38C3_POSITION                 equ 0006h
LCDDATA22_S38C3_SIZE                     equ 0001h
LCDDATA22_S38C3_LENGTH                   equ 0001h
LCDDATA22_S38C3_MASK                     equ 0040h
LCDDATA22_S39C3_POSN                     equ 0007h
LCDDATA22_S39C3_POSITION                 equ 0007h
LCDDATA22_S39C3_SIZE                     equ 0001h
LCDDATA22_S39C3_LENGTH                   equ 0001h
LCDDATA22_S39C3_MASK                     equ 0080h

// Register: LCDDATA23
#define LCDDATA23 LCDDATA23
LCDDATA23                                equ 019Bh
// bitfield definitions
LCDDATA23_SEG40_POSN                     equ 0000h
LCDDATA23_SEG40_POSITION                 equ 0000h
LCDDATA23_SEG40_SIZE                     equ 0001h
LCDDATA23_SEG40_LENGTH                   equ 0001h
LCDDATA23_SEG40_MASK                     equ 0001h
LCDDATA23_SEG41_POSN                     equ 0001h
LCDDATA23_SEG41_POSITION                 equ 0001h
LCDDATA23_SEG41_SIZE                     equ 0001h
LCDDATA23_SEG41_LENGTH                   equ 0001h
LCDDATA23_SEG41_MASK                     equ 0002h
LCDDATA23_SEG40COM3_POSN                 equ 0000h
LCDDATA23_SEG40COM3_POSITION             equ 0000h
LCDDATA23_SEG40COM3_SIZE                 equ 0001h
LCDDATA23_SEG40COM3_LENGTH               equ 0001h
LCDDATA23_SEG40COM3_MASK                 equ 0001h
LCDDATA23_SEG41COM3_POSN                 equ 0001h
LCDDATA23_SEG41COM3_POSITION             equ 0001h
LCDDATA23_SEG41COM3_SIZE                 equ 0001h
LCDDATA23_SEG41COM3_LENGTH               equ 0001h
LCDDATA23_SEG41COM3_MASK                 equ 0002h
LCDDATA23_S40C3_POSN                     equ 0000h
LCDDATA23_S40C3_POSITION                 equ 0000h
LCDDATA23_S40C3_SIZE                     equ 0001h
LCDDATA23_S40C3_LENGTH                   equ 0001h
LCDDATA23_S40C3_MASK                     equ 0001h
LCDDATA23_S41C3_POSN                     equ 0001h
LCDDATA23_S41C3_POSITION                 equ 0001h
LCDDATA23_S41C3_SIZE                     equ 0001h
LCDDATA23_S41C3_LENGTH                   equ 0001h
LCDDATA23_S41C3_MASK                     equ 0002h

// Register: LCDSE3
#define LCDSE3 LCDSE3
LCDSE3                                   equ 019Ch
// bitfield definitions
LCDSE3_SEG24_POSN                        equ 0000h
LCDSE3_SEG24_POSITION                    equ 0000h
LCDSE3_SEG24_SIZE                        equ 0001h
LCDSE3_SEG24_LENGTH                      equ 0001h
LCDSE3_SEG24_MASK                        equ 0001h
LCDSE3_SEG25_POSN                        equ 0001h
LCDSE3_SEG25_POSITION                    equ 0001h
LCDSE3_SEG25_SIZE                        equ 0001h
LCDSE3_SEG25_LENGTH                      equ 0001h
LCDSE3_SEG25_MASK                        equ 0002h
LCDSE3_SEG26_POSN                        equ 0002h
LCDSE3_SEG26_POSITION                    equ 0002h
LCDSE3_SEG26_SIZE                        equ 0001h
LCDSE3_SEG26_LENGTH                      equ 0001h
LCDSE3_SEG26_MASK                        equ 0004h
LCDSE3_SEG27_POSN                        equ 0003h
LCDSE3_SEG27_POSITION                    equ 0003h
LCDSE3_SEG27_SIZE                        equ 0001h
LCDSE3_SEG27_LENGTH                      equ 0001h
LCDSE3_SEG27_MASK                        equ 0008h
LCDSE3_SEG28_POSN                        equ 0004h
LCDSE3_SEG28_POSITION                    equ 0004h
LCDSE3_SEG28_SIZE                        equ 0001h
LCDSE3_SEG28_LENGTH                      equ 0001h
LCDSE3_SEG28_MASK                        equ 0010h
LCDSE3_SEG29_POSN                        equ 0005h
LCDSE3_SEG29_POSITION                    equ 0005h
LCDSE3_SEG29_SIZE                        equ 0001h
LCDSE3_SEG29_LENGTH                      equ 0001h
LCDSE3_SEG29_MASK                        equ 0020h
LCDSE3_SEG30_POSN                        equ 0006h
LCDSE3_SEG30_POSITION                    equ 0006h
LCDSE3_SEG30_SIZE                        equ 0001h
LCDSE3_SEG30_LENGTH                      equ 0001h
LCDSE3_SEG30_MASK                        equ 0040h
LCDSE3_SEG31_POSN                        equ 0007h
LCDSE3_SEG31_POSITION                    equ 0007h
LCDSE3_SEG31_SIZE                        equ 0001h
LCDSE3_SEG31_LENGTH                      equ 0001h
LCDSE3_SEG31_MASK                        equ 0080h
LCDSE3_SE24_POSN                         equ 0000h
LCDSE3_SE24_POSITION                     equ 0000h
LCDSE3_SE24_SIZE                         equ 0001h
LCDSE3_SE24_LENGTH                       equ 0001h
LCDSE3_SE24_MASK                         equ 0001h
LCDSE3_SE25_POSN                         equ 0001h
LCDSE3_SE25_POSITION                     equ 0001h
LCDSE3_SE25_SIZE                         equ 0001h
LCDSE3_SE25_LENGTH                       equ 0001h
LCDSE3_SE25_MASK                         equ 0002h
LCDSE3_SE26_POSN                         equ 0002h
LCDSE3_SE26_POSITION                     equ 0002h
LCDSE3_SE26_SIZE                         equ 0001h
LCDSE3_SE26_LENGTH                       equ 0001h
LCDSE3_SE26_MASK                         equ 0004h
LCDSE3_SE27_POSN                         equ 0003h
LCDSE3_SE27_POSITION                     equ 0003h
LCDSE3_SE27_SIZE                         equ 0001h
LCDSE3_SE27_LENGTH                       equ 0001h
LCDSE3_SE27_MASK                         equ 0008h
LCDSE3_SE28_POSN                         equ 0004h
LCDSE3_SE28_POSITION                     equ 0004h
LCDSE3_SE28_SIZE                         equ 0001h
LCDSE3_SE28_LENGTH                       equ 0001h
LCDSE3_SE28_MASK                         equ 0010h
LCDSE3_SE29_POSN                         equ 0005h
LCDSE3_SE29_POSITION                     equ 0005h
LCDSE3_SE29_SIZE                         equ 0001h
LCDSE3_SE29_LENGTH                       equ 0001h
LCDSE3_SE29_MASK                         equ 0020h
LCDSE3_SE30_POSN                         equ 0006h
LCDSE3_SE30_POSITION                     equ 0006h
LCDSE3_SE30_SIZE                         equ 0001h
LCDSE3_SE30_LENGTH                       equ 0001h
LCDSE3_SE30_MASK                         equ 0040h
LCDSE3_SE31_POSN                         equ 0007h
LCDSE3_SE31_POSITION                     equ 0007h
LCDSE3_SE31_SIZE                         equ 0001h
LCDSE3_SE31_LENGTH                       equ 0001h
LCDSE3_SE31_MASK                         equ 0080h
LCDSE3_SEGEN24_POSN                      equ 0000h
LCDSE3_SEGEN24_POSITION                  equ 0000h
LCDSE3_SEGEN24_SIZE                      equ 0001h
LCDSE3_SEGEN24_LENGTH                    equ 0001h
LCDSE3_SEGEN24_MASK                      equ 0001h
LCDSE3_SEGEN25_POSN                      equ 0001h
LCDSE3_SEGEN25_POSITION                  equ 0001h
LCDSE3_SEGEN25_SIZE                      equ 0001h
LCDSE3_SEGEN25_LENGTH                    equ 0001h
LCDSE3_SEGEN25_MASK                      equ 0002h
LCDSE3_SEGEN26_POSN                      equ 0002h
LCDSE3_SEGEN26_POSITION                  equ 0002h
LCDSE3_SEGEN26_SIZE                      equ 0001h
LCDSE3_SEGEN26_LENGTH                    equ 0001h
LCDSE3_SEGEN26_MASK                      equ 0004h
LCDSE3_SEGEN27_POSN                      equ 0003h
LCDSE3_SEGEN27_POSITION                  equ 0003h
LCDSE3_SEGEN27_SIZE                      equ 0001h
LCDSE3_SEGEN27_LENGTH                    equ 0001h
LCDSE3_SEGEN27_MASK                      equ 0008h
LCDSE3_SEGEN28_POSN                      equ 0004h
LCDSE3_SEGEN28_POSITION                  equ 0004h
LCDSE3_SEGEN28_SIZE                      equ 0001h
LCDSE3_SEGEN28_LENGTH                    equ 0001h
LCDSE3_SEGEN28_MASK                      equ 0010h
LCDSE3_SEGEN29_POSN                      equ 0005h
LCDSE3_SEGEN29_POSITION                  equ 0005h
LCDSE3_SEGEN29_SIZE                      equ 0001h
LCDSE3_SEGEN29_LENGTH                    equ 0001h
LCDSE3_SEGEN29_MASK                      equ 0020h
LCDSE3_SEGEN30_POSN                      equ 0006h
LCDSE3_SEGEN30_POSITION                  equ 0006h
LCDSE3_SEGEN30_SIZE                      equ 0001h
LCDSE3_SEGEN30_LENGTH                    equ 0001h
LCDSE3_SEGEN30_MASK                      equ 0040h
LCDSE3_SEGEN31_POSN                      equ 0007h
LCDSE3_SEGEN31_POSITION                  equ 0007h
LCDSE3_SEGEN31_SIZE                      equ 0001h
LCDSE3_SEGEN31_LENGTH                    equ 0001h
LCDSE3_SEGEN31_MASK                      equ 0080h

