GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
// Register: LCDSE4
#define LCDSE4 LCDSE4
LCDSE4                                   equ 019Dh
// bitfield definitions
LCDSE4_SEG32_POSN                        equ 0000h
LCDSE4_SEG32_POSITION                    equ 0000h
LCDSE4_SEG32_SIZE                        equ 0001h
LCDSE4_SEG32_LENGTH                      equ 0001h
LCDSE4_SEG32_MASK                        equ 0001h
LCDSE4_SEG33_POSN                        equ 0001h
LCDSE4_SEG33_POSITION                    equ 0001h
LCDSE4_SEG33_SIZE                        equ 0001h
LCDSE4_SEG33_LENGTH                      equ 0001h
LCDSE4_SEG33_MASK                        equ 0002h
LCDSE4_SEG34_POSN                        equ 0002h
LCDSE4_SEG34_POSITION                    equ 0002h
LCDSE4_SEG34_SIZE                        equ 0001h
LCDSE4_SEG34_LENGTH                      equ 0001h
LCDSE4_SEG34_MASK                        equ 0004h
LCDSE4_SEG35_POSN                        equ 0003h
LCDSE4_SEG35_POSITION                    equ 0003h
LCDSE4_SEG35_SIZE                        equ 0001h
LCDSE4_SEG35_LENGTH                      equ 0001h
LCDSE4_SEG35_MASK                        equ 0008h
LCDSE4_SEG36_POSN                        equ 0004h
LCDSE4_SEG36_POSITION                    equ 0004h
LCDSE4_SEG36_SIZE                        equ 0001h
LCDSE4_SEG36_LENGTH                      equ 0001h
LCDSE4_SEG36_MASK                        equ 0010h
LCDSE4_SEG37_POSN                        equ 0005h
LCDSE4_SEG37_POSITION                    equ 0005h
LCDSE4_SEG37_SIZE                        equ 0001h
LCDSE4_SEG37_LENGTH                      equ 0001h
LCDSE4_SEG37_MASK                        equ 0020h
LCDSE4_SEG38_POSN                        equ 0006h
LCDSE4_SEG38_POSITION                    equ 0006h
LCDSE4_SEG38_SIZE                        equ 0001h
LCDSE4_SEG38_LENGTH                      equ 0001h
LCDSE4_SEG38_MASK                        equ 0040h
LCDSE4_SEG39_POSN                        equ 0007h
LCDSE4_SEG39_POSITION                    equ 0007h
LCDSE4_SEG39_SIZE                        equ 0001h
LCDSE4_SEG39_LENGTH                      equ 0001h
LCDSE4_SEG39_MASK                        equ 0080h
LCDSE4_SE32_POSN                         equ 0000h
LCDSE4_SE32_POSITION                     equ 0000h
LCDSE4_SE32_SIZE                         equ 0001h
LCDSE4_SE32_LENGTH                       equ 0001h
LCDSE4_SE32_MASK                         equ 0001h
LCDSE4_SE33_POSN                         equ 0001h
LCDSE4_SE33_POSITION                     equ 0001h
LCDSE4_SE33_SIZE                         equ 0001h
LCDSE4_SE33_LENGTH                       equ 0001h
LCDSE4_SE33_MASK                         equ 0002h
LCDSE4_SE34_POSN                         equ 0002h
LCDSE4_SE34_POSITION                     equ 0002h
LCDSE4_SE34_SIZE                         equ 0001h
LCDSE4_SE34_LENGTH                       equ 0001h
LCDSE4_SE34_MASK                         equ 0004h
LCDSE4_SE35_POSN                         equ 0003h
LCDSE4_SE35_POSITION                     equ 0003h
LCDSE4_SE35_SIZE                         equ 0001h
LCDSE4_SE35_LENGTH                       equ 0001h
LCDSE4_SE35_MASK                         equ 0008h
LCDSE4_SE36_POSN                         equ 0004h
LCDSE4_SE36_POSITION                     equ 0004h
LCDSE4_SE36_SIZE                         equ 0001h
LCDSE4_SE36_LENGTH                       equ 0001h
LCDSE4_SE36_MASK                         equ 0010h
LCDSE4_SE37_POSN                         equ 0005h
LCDSE4_SE37_POSITION                     equ 0005h
LCDSE4_SE37_SIZE                         equ 0001h
LCDSE4_SE37_LENGTH                       equ 0001h
LCDSE4_SE37_MASK                         equ 0020h
LCDSE4_SE38_POSN                         equ 0006h
LCDSE4_SE38_POSITION                     equ 0006h
LCDSE4_SE38_SIZE                         equ 0001h
LCDSE4_SE38_LENGTH                       equ 0001h
LCDSE4_SE38_MASK                         equ 0040h
LCDSE4_SE39_POSN                         equ 0007h
LCDSE4_SE39_POSITION                     equ 0007h
LCDSE4_SE39_SIZE                         equ 0001h
LCDSE4_SE39_LENGTH                       equ 0001h
LCDSE4_SE39_MASK                         equ 0080h
LCDSE4_SEGEN32_POSN                      equ 0000h
LCDSE4_SEGEN32_POSITION                  equ 0000h
LCDSE4_SEGEN32_SIZE                      equ 0001h
LCDSE4_SEGEN32_LENGTH                    equ 0001h
LCDSE4_SEGEN32_MASK                      equ 0001h
LCDSE4_SEGEN33_POSN                      equ 0001h
LCDSE4_SEGEN33_POSITION                  equ 0001h
LCDSE4_SEGEN33_SIZE                      equ 0001h
LCDSE4_SEGEN33_LENGTH                    equ 0001h
LCDSE4_SEGEN33_MASK                      equ 0002h
LCDSE4_SEGEN34_POSN                      equ 0002h
LCDSE4_SEGEN34_POSITION                  equ 0002h
LCDSE4_SEGEN34_SIZE                      equ 0001h
LCDSE4_SEGEN34_LENGTH                    equ 0001h
LCDSE4_SEGEN34_MASK                      equ 0004h
LCDSE4_SEGEN35_POSN                      equ 0003h
LCDSE4_SEGEN35_POSITION                  equ 0003h
LCDSE4_SEGEN35_SIZE                      equ 0001h
LCDSE4_SEGEN35_LENGTH                    equ 0001h
LCDSE4_SEGEN35_MASK                      equ 0008h
LCDSE4_SEGEN36_POSN                      equ 0004h
LCDSE4_SEGEN36_POSITION                  equ 0004h
LCDSE4_SEGEN36_SIZE                      equ 0001h
LCDSE4_SEGEN36_LENGTH                    equ 0001h
LCDSE4_SEGEN36_MASK                      equ 0010h
LCDSE4_SEGEN37_POSN                      equ 0005h
LCDSE4_SEGEN37_POSITION                  equ 0005h
LCDSE4_SEGEN37_SIZE                      equ 0001h
LCDSE4_SEGEN37_LENGTH                    equ 0001h
LCDSE4_SEGEN37_MASK                      equ 0020h
LCDSE4_SEGEN38_POSN                      equ 0006h
LCDSE4_SEGEN38_POSITION                  equ 0006h
LCDSE4_SEGEN38_SIZE                      equ 0001h
LCDSE4_SEGEN38_LENGTH                    equ 0001h
LCDSE4_SEGEN38_MASK                      equ 0040h
LCDSE4_SEGEN39_POSN                      equ 0007h
LCDSE4_SEGEN39_POSITION                  equ 0007h
LCDSE4_SEGEN39_SIZE                      equ 0001h
LCDSE4_SEGEN39_LENGTH                    equ 0001h
LCDSE4_SEGEN39_MASK                      equ 0080h

// Register: LCDSE5
#define LCDSE5 LCDSE5
LCDSE5                                   equ 019Eh
// bitfield definitions
LCDSE5_SEG40_POSN                        equ 0000h
LCDSE5_SEG40_POSITION                    equ 0000h
LCDSE5_SEG40_SIZE                        equ 0001h
LCDSE5_SEG40_LENGTH                      equ 0001h
LCDSE5_SEG40_MASK                        equ 0001h
LCDSE5_SEG41_POSN                        equ 0001h
LCDSE5_SEG41_POSITION                    equ 0001h
LCDSE5_SEG41_SIZE                        equ 0001h
LCDSE5_SEG41_LENGTH                      equ 0001h
LCDSE5_SEG41_MASK                        equ 0002h
LCDSE5_SE40_POSN                         equ 0000h
LCDSE5_SE40_POSITION                     equ 0000h
LCDSE5_SE40_SIZE                         equ 0001h
LCDSE5_SE40_LENGTH                       equ 0001h
LCDSE5_SE40_MASK                         equ 0001h
LCDSE5_SE41_POSN                         equ 0001h
LCDSE5_SE41_POSITION                     equ 0001h
LCDSE5_SE41_SIZE                         equ 0001h
LCDSE5_SE41_LENGTH                       equ 0001h
LCDSE5_SE41_MASK                         equ 0002h
LCDSE5_SEGEN40_POSN                      equ 0000h
LCDSE5_SEGEN40_POSITION                  equ 0000h
LCDSE5_SEGEN40_SIZE                      equ 0001h
LCDSE5_SEGEN40_LENGTH                    equ 0001h
LCDSE5_SEGEN40_MASK                      equ 0001h
LCDSE5_SEGEN41_POSN                      equ 0001h
LCDSE5_SEGEN41_POSITION                  equ 0001h
LCDSE5_SEGEN41_SIZE                      equ 0001h
LCDSE5_SEGEN41_LENGTH                    equ 0001h
LCDSE5_SEGEN41_MASK                      equ 0002h

