GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADDEN                            BANKMASK(RCSTA), 3
#define ADFM                             BANKMASK(ADCON0), 7
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define AN0                              BANKMASK(ANSEL), 0
#define AN1                              BANKMASK(ANSEL), 1
#define AN2                              BANKMASK(ANSEL), 2
#define AN3                              BANKMASK(ANSEL), 3
#define AN4                              BANKMASK(ANSEL), 4
#define AN5                              BANKMASK(ANSEL), 5
#define AN6                              BANKMASK(ANSEL), 6
#define AN7                              BANKMASK(ANSEL), 7
#define ANS0                             BANKMASK(ANSEL), 0
#define ANS1                             BANKMASK(ANSEL), 1
#define ANS2                             BANKMASK(ANSEL), 2
#define ANS3                             BANKMASK(ANSEL), 3
#define ANS4                             BANKMASK(ANSEL), 4
#define ANS5                             BANKMASK(ANSEL), 5
#define ANS6                             BANKMASK(ANSEL), 6
#define ANS7                             BANKMASK(ANSEL), 7
#define BF                               BANKMASK(SSPSTAT), 0
#define BIASMD                           BANKMASK(LCDPS), 6
#define BRGH                             BANKMASK(TXSTA), 2
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INV                            BANKMASK(CMCON0), 4
#define C1OUT                            BANKMASK(CMCON0), 6
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2INV                            BANKMASK(CMCON0), 5
#define C2OUT                            BANKMASK(CMCON0), 7
#define C2SYNC                           BANKMASK(CMCON1), 0
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CCP1X                            BANKMASK(CCP1CON), 5
#define CCP1Y                            BANKMASK(CCP1CON), 4
#define CCP2IE                           BANKMASK(PIE2), 0
#define CCP2IF                           BANKMASK(PIR2), 0
#define CCP2M0                           BANKMASK(CCP2CON), 0
#define CCP2M1                           BANKMASK(CCP2CON), 1
#define CCP2M2                           BANKMASK(CCP2CON), 2
#define CCP2M3                           BANKMASK(CCP2CON), 3
#define CCP2X                            BANKMASK(CCP2CON), 5
#define CCP2Y                            BANKMASK(CCP2CON), 4
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CIS                              BANKMASK(CMCON0), 3
#define CKE                              BANKMASK(SSPSTAT), 6
#define CKP                              BANKMASK(SSPCON), 4
#define CM0                              BANKMASK(CMCON0), 0
#define CM1                              BANKMASK(CMCON0), 1
#define CM2                              BANKMASK(CMCON0), 2
#define CREN                             BANKMASK(RCSTA), 4
#define CS0                              BANKMASK(LCDCON), 2
#define CS1                              BANKMASK(LCDCON), 3
#define CSRC                             BANKMASK(TXSTA), 7
#define DATA_ADDRESS                     BANKMASK(SSPSTAT), 5
#define DC                               BANKMASK(STATUS), 1
#define D_A                              BANKMASK(SSPSTAT), 5
#define D_nA                             BANKMASK(SSPSTAT), 5
#define EEADRH0                          BANKMASK(EEADRH), 0
#define EEADRH1                          BANKMASK(EEADRH), 1
#define EEADRH2                          BANKMASK(EEADRH), 2
#define EEADRH3                          BANKMASK(EEADRH), 3
#define EEADRH4                          BANKMASK(EEADRH), 4
#define EEADRL0                          BANKMASK(EEADRL), 0
#define EEADRL1                          BANKMASK(EEADRL), 1
#define EEADRL2                          BANKMASK(EEADRL), 2
#define EEADRL3                          BANKMASK(EEADRL), 3
#define EEADRL4                          BANKMASK(EEADRL), 4
#define EEADRL5                          BANKMASK(EEADRL), 5
#define EEADRL6                          BANKMASK(EEADRL), 6
#define EEADRL7                          BANKMASK(EEADRL), 7
#define EEDATH0                          BANKMASK(EEDATH), 0
#define EEDATH1                          BANKMASK(EEDATH), 1
#define EEDATH2                          BANKMASK(EEDATH), 2
#define EEDATH3                          BANKMASK(EEDATH), 3
#define EEDATH4                          BANKMASK(EEDATH), 4
#define EEDATH5                          BANKMASK(EEDATH), 5
#define EEDATL0                          BANKMASK(EEDATL), 0
#define EEDATL1                          BANKMASK(EEDATL), 1
#define EEDATL2                          BANKMASK(EEDATL), 2
#define EEDATL3                          BANKMASK(EEDATL), 3
#define EEDATL4                          BANKMASK(EEDATL), 4
#define EEDATL5                          BANKMASK(EEDATL), 5
#define EEDATL6                          BANKMASK(EEDATL), 6
#define EEDATL7                          BANKMASK(EEDATL), 7
#define EEIE                             BANKMASK(PIE1), 7
#define EEIF                             BANKMASK(PIR1), 7
#define EEPGD                            BANKMASK(EECON1), 7
#define EERD                             BANKMASK(EECON1), 0
#define EEWR                             BANKMASK(EECON1), 1
#define FERR                             BANKMASK(RCSTA), 2
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_DONE                          BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HTS                              BANKMASK(OSCCON), 2
#define I2C_DATA                         BANKMASK(SSPSTAT), 5
#define I2C_READ                         BANKMASK(SSPSTAT), 2
#define I2C_START                        BANKMASK(SSPSTAT), 3
#define I2C_STOP                         BANKMASK(SSPSTAT), 4
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOC4                             BANKMASK(IOCB), 4
#define IOC5                             BANKMASK(IOCB), 5
#define IOC6                             BANKMASK(IOCB), 6
#define IOC7                             BANKMASK(IOCB), 7
#define IOCB4                            BANKMASK(IOCB), 4
#define IOCB5                            BANKMASK(IOCB), 5
#define IOCB6                            BANKMASK(IOCB), 6
#define IOCB7                            BANKMASK(IOCB), 7
#define IRCF0                            BANKMASK(OSCCON), 4
#define IRCF1                            BANKMASK(OSCCON), 5
#define IRCF2                            BANKMASK(OSCCON), 6
#define IRVST                            BANKMASK(LVDCON), 5
#define LCDA                             BANKMASK(LCDPS), 5
#define LCDEN                            BANKMASK(LCDCON), 7
#define LCDIE                            BANKMASK(PIE2), 4
#define LCDIF                            BANKMASK(PIR2), 4
#define LMUX0                            BANKMASK(LCDCON), 0
#define LMUX1                            BANKMASK(LCDCON), 1
#define LP0                              BANKMASK(LCDPS), 0
#define LP1                              BANKMASK(LCDPS), 1
#define LP2                              BANKMASK(LCDPS), 2
#define LP3                              BANKMASK(LCDPS), 3
#define LTS                              BANKMASK(OSCCON), 1
#define LVDEN                            BANKMASK(LVDCON), 4
#define LVDIE                            BANKMASK(PIE2), 2
#define LVDIF                            BANKMASK(PIR2), 2
#define LVDL0                            BANKMASK(LVDCON), 0
#define LVDL1                            BANKMASK(LVDCON), 1
#define LVDL2                            BANKMASK(LVDCON), 2
#define OERR                             BANKMASK(RCSTA), 1
#define OSFIE                            BANKMASK(PIE2), 7
#define OSFIF                            BANKMASK(PIR2), 7
#define OSTS                             BANKMASK(OSCCON), 3
#define PEIE                             BANKMASK(INTCON), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RBIE                             BANKMASK(INTCON), 3
#define RBIF                             BANKMASK(INTCON), 0
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RC8_9                            BANKMASK(RCSTA), 6
#define RC9                              BANKMASK(RCSTA), 6
#define RCD8                             BANKMASK(RCSTA), 0
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(EECON1), 0
#define RD0                              BANKMASK(PORTD), 0
#define RD1                              BANKMASK(PORTD), 1
#define RD2                              BANKMASK(PORTD), 2
#define RD3                              BANKMASK(PORTD), 3
#define RD4                              BANKMASK(PORTD), 4
#define RD5                              BANKMASK(PORTD), 5
#define RD6                              BANKMASK(PORTD), 6
#define RD7                              BANKMASK(PORTD), 7
#define RE0                              BANKMASK(PORTE), 0
#define RE1                              BANKMASK(PORTE), 1
#define RE2                              BANKMASK(PORTE), 2
#define RE3                              BANKMASK(PORTE), 3
#define RE4                              BANKMASK(PORTE), 4
#define RE5                              BANKMASK(PORTE), 5
#define RE6                              BANKMASK(PORTE), 6
#define RE7                              BANKMASK(PORTE), 7
#define READ_WRITE                       BANKMASK(SSPSTAT), 2
#define RF0                              BANKMASK(PORTF), 0
#define RF1                              BANKMASK(PORTF), 1
#define RF2                              BANKMASK(PORTF), 2
#define RF3                              BANKMASK(PORTF), 3
#define RF4                              BANKMASK(PORTF), 4
#define RF5                              BANKMASK(PORTF), 5
#define RF6                              BANKMASK(PORTF), 6
#define RF7                              BANKMASK(PORTF), 7
#define RG0                              BANKMASK(PORTG), 0
#define RG1                              BANKMASK(PORTG), 1
#define RG2                              BANKMASK(PORTG), 2
#define RG3                              BANKMASK(PORTG), 3
#define RG4                              BANKMASK(PORTG), 4
#define RG5                              BANKMASK(PORTG), 5
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define RX9                              BANKMASK(RCSTA), 6
#define RX9D                             BANKMASK(RCSTA), 0
#define R_W                              BANKMASK(SSPSTAT), 2
#define R_nW                             BANKMASK(SSPSTAT), 2
#define S0C0                             BANKMASK(LCDDATA0), 0
#define S0C1                             BANKMASK(LCDDATA3), 0
#define S0C2                             BANKMASK(LCDDATA6), 0
#define S0C3                             BANKMASK(LCDDATA9), 0
#define S10C0                            BANKMASK(LCDDATA1), 2
#define S10C1                            BANKMASK(LCDDATA4), 2
#define S10C2                            BANKMASK(LCDDATA7), 2
#define S10C3                            BANKMASK(LCDDATA10), 2
#define S11C0                            BANKMASK(LCDDATA1), 3
#define S11C1                            BANKMASK(LCDDATA4), 3
#define S11C2                            BANKMASK(LCDDATA7), 3
#define S11C3                            BANKMASK(LCDDATA10), 3
#define S12C0                            BANKMASK(LCDDATA1), 4
#define S12C1                            BANKMASK(LCDDATA4), 4
#define S12C2                            BANKMASK(LCDDATA7), 4
#define S12C3                            BANKMASK(LCDDATA10), 4
#define S13C0                            BANKMASK(LCDDATA1), 5
#define S13C1                            BANKMASK(LCDDATA4), 5
#define S13C2                            BANKMASK(LCDDATA7), 5
#define S13C3                            BANKMASK(LCDDATA10), 5
#define S14C0                            BANKMASK(LCDDATA1), 6
#define S14C1                            BANKMASK(LCDDATA4), 6
#define S14C2                            BANKMASK(LCDDATA7), 6
#define S14C3                            BANKMASK(LCDDATA10), 6
#define S15C0                            BANKMASK(LCDDATA1), 7
#define S15C1                            BANKMASK(LCDDATA4), 7
#define S15C2                            BANKMASK(LCDDATA7), 7
#define S15C3                            BANKMASK(LCDDATA10), 7
#define S16C0                            BANKMASK(LCDDATA2), 0
#define S16C1                            BANKMASK(LCDDATA5), 0
#define S16C2                            BANKMASK(LCDDATA8), 0
#define S16C3                            BANKMASK(LCDDATA11), 0
#define S17C0                            BANKMASK(LCDDATA2), 1
#define S17C1                            BANKMASK(LCDDATA5), 1
#define S17C2                            BANKMASK(LCDDATA8), 1
#define S17C3                            BANKMASK(LCDDATA11), 1
#define S18C0                            BANKMASK(LCDDATA2), 2
#define S18C1                            BANKMASK(LCDDATA5), 2
#define S18C2                            BANKMASK(LCDDATA8), 2
#define S18C3                            BANKMASK(LCDDATA11), 2
#define S19C0                            BANKMASK(LCDDATA2), 3
#define S19C1                            BANKMASK(LCDDATA5), 3
#define S19C2                            BANKMASK(LCDDATA8), 3
#define S19C3                            BANKMASK(LCDDATA11), 3
#define S1C0                             BANKMASK(LCDDATA0), 1
#define S1C1                             BANKMASK(LCDDATA3), 1
#define S1C2                             BANKMASK(LCDDATA6), 1
#define S1C3                             BANKMASK(LCDDATA9), 1
#define S20C0                            BANKMASK(LCDDATA2), 4
#define S20C1                            BANKMASK(LCDDATA5), 4
#define S20C2                            BANKMASK(LCDDATA8), 4
#define S20C3                            BANKMASK(LCDDATA11), 4
#define S21C0                            BANKMASK(LCDDATA2), 5
#define S21C1                            BANKMASK(LCDDATA5), 5
#define S21C2                            BANKMASK(LCDDATA8), 5
#define S21C3                            BANKMASK(LCDDATA11), 5
#define S22C0                            BANKMASK(LCDDATA2), 6
#define S22C1                            BANKMASK(LCDDATA5), 6
#define S22C2                            BANKMASK(LCDDATA8), 6
#define S22C3                            BANKMASK(LCDDATA11), 6
#define S23C0                            BANKMASK(LCDDATA2), 7
#define S23C1                            BANKMASK(LCDDATA5), 7
#define S23C2                            BANKMASK(LCDDATA8), 7
#define S23C3                            BANKMASK(LCDDATA11), 7
#define S24C0                            BANKMASK(LCDDATA12), 0
#define S24C1                            BANKMASK(LCDDATA15), 0
#define S24C2                            BANKMASK(LCDDATA18), 0
#define S24C3                            BANKMASK(LCDDATA21), 0
#define S25C0                            BANKMASK(LCDDATA12), 1
#define S25C1                            BANKMASK(LCDDATA15), 1
#define S25C2                            BANKMASK(LCDDATA18), 1
#define S25C3                            BANKMASK(LCDDATA21), 1
#define S26C0                            BANKMASK(LCDDATA12), 2
#define S26C1                            BANKMASK(LCDDATA15), 2
#define S26C2                            BANKMASK(LCDDATA18), 2
#define S26C3                            BANKMASK(LCDDATA21), 2
#define S27C0                            BANKMASK(LCDDATA12), 3
#define S27C1                            BANKMASK(LCDDATA15), 3
#define S27C2                            BANKMASK(LCDDATA18), 3
#define S27C3                            BANKMASK(LCDDATA21), 3
#define S28C0                            BANKMASK(LCDDATA12), 4
#define S28C1                            BANKMASK(LCDDATA15), 4
#define S28C2                            BANKMASK(LCDDATA18), 4
#define S28C3                            BANKMASK(LCDDATA21), 4
#define S29C0                            BANKMASK(LCDDATA12), 5
#define S29C1                            BANKMASK(LCDDATA15), 5
#define S29C2                            BANKMASK(LCDDATA18), 5
#define S29C3                            BANKMASK(LCDDATA21), 5
#define S2C0                             BANKMASK(LCDDATA0), 2
#define S2C1                             BANKMASK(LCDDATA3), 2
#define S2C2                             BANKMASK(LCDDATA6), 2
#define S2C3                             BANKMASK(LCDDATA9), 2
#define S30C0                            BANKMASK(LCDDATA12), 6
#define S30C1                            BANKMASK(LCDDATA15), 6
#define S30C2                            BANKMASK(LCDDATA18), 6
#define S30C3                            BANKMASK(LCDDATA21), 6
#define S31C0                            BANKMASK(LCDDATA12), 7
#define S31C1                            BANKMASK(LCDDATA15), 7
#define S31C2                            BANKMASK(LCDDATA18), 7
#define S31C3                            BANKMASK(LCDDATA21), 7
#define S32C0                            BANKMASK(LCDDATA13), 0
#define S32C1                            BANKMASK(LCDDATA16), 0
#define S32C2                            BANKMASK(LCDDATA19), 0
#define S32C3                            BANKMASK(LCDDATA22), 0
#define S33C0                            BANKMASK(LCDDATA13), 1
#define S33C1                            BANKMASK(LCDDATA16), 1
#define S33C2                            BANKMASK(LCDDATA19), 1
#define S33C3                            BANKMASK(LCDDATA22), 1
#define S34C0                            BANKMASK(LCDDATA13), 2
#define S34C1                            BANKMASK(LCDDATA16), 2
#define S34C2                            BANKMASK(LCDDATA19), 2
#define S34C3                            BANKMASK(LCDDATA22), 2
#define S35C0                            BANKMASK(LCDDATA13), 3
#define S35C1                            BANKMASK(LCDDATA16), 3
#define S35C2                            BANKMASK(LCDDATA19), 3
#define S35C3                            BANKMASK(LCDDATA22), 3
#define S36C0                            BANKMASK(LCDDATA13), 4
#define S36C1                            BANKMASK(LCDDATA16), 4
#define S36C2                            BANKMASK(LCDDATA19), 4
#define S36C3                            BANKMASK(LCDDATA22), 4
#define S37C0                            BANKMASK(LCDDATA13), 5
#define S37C1                            BANKMASK(LCDDATA16), 5
#define S37C2                            BANKMASK(LCDDATA19), 5
#define S37C3                            BANKMASK(LCDDATA22), 5
#define S38C0                            BANKMASK(LCDDATA13), 6
#define S38C1                            BANKMASK(LCDDATA16), 6
#define S38C2                            BANKMASK(LCDDATA19), 6
#define S38C3                            BANKMASK(LCDDATA22), 6
#define S39C0                            BANKMASK(LCDDATA13), 7
#define S39C1                            BANKMASK(LCDDATA16), 7
#define S39C2                            BANKMASK(LCDDATA19), 7
#define S39C3                            BANKMASK(LCDDATA22), 7
#define S3C0                             BANKMASK(LCDDATA0), 3
#define S3C1                             BANKMASK(LCDDATA3), 3
#define S3C2                             BANKMASK(LCDDATA6), 3
#define S3C3                             BANKMASK(LCDDATA9), 3
#define S40C0                            BANKMASK(LCDDATA14), 0
#define S40C1                            BANKMASK(LCDDATA17), 0
#define S40C2                            BANKMASK(LCDDATA20), 0
#define S40C3                            BANKMASK(LCDDATA23), 0
#define S41C0                            BANKMASK(LCDDATA14), 1
#define S41C1                            BANKMASK(LCDDATA17), 1
#define S41C2                            BANKMASK(LCDDATA20), 1
#define S41C3                            BANKMASK(LCDDATA23), 1
#define S4C0                             BANKMASK(LCDDATA0), 4
#define S4C1                             BANKMASK(LCDDATA3), 4
#define S4C2                             BANKMASK(LCDDATA6), 4
#define S4C3                             BANKMASK(LCDDATA9), 4
#define S5C0                             BANKMASK(LCDDATA0), 5
#define S5C1                             BANKMASK(LCDDATA3), 5
#define S5C2                             BANKMASK(LCDDATA6), 5
#define S5C3                             BANKMASK(LCDDATA9), 5
#define S6C0                             BANKMASK(LCDDATA0), 6
#define S6C1                             BANKMASK(LCDDATA3), 6
#define S6C2                             BANKMASK(LCDDATA6), 6
#define S6C3                             BANKMASK(LCDDATA9), 6
#define S7C0                             BANKMASK(LCDDATA0), 7
#define S7C1                             BANKMASK(LCDDATA3), 7
#define S7C2                             BANKMASK(LCDDATA6), 7
#define S7C3                             BANKMASK(LCDDATA9), 7
#define S8C0                             BANKMASK(LCDDATA1), 0
#define S8C1                             BANKMASK(LCDDATA4), 0
#define S8C2                             BANKMASK(LCDDATA7), 0
