GopalSaraf/Practicals/PSDL/include/proc/pic16f946.inc
#define S8C3                             BANKMASK(LCDDATA10), 0
#define S9C0                             BANKMASK(LCDDATA1), 1
#define S9C1                             BANKMASK(LCDDATA4), 1
#define S9C2                             BANKMASK(LCDDATA7), 1
#define S9C3                             BANKMASK(LCDDATA10), 1
#define SBOREN                           BANKMASK(PCON), 4
#define SCS                              BANKMASK(OSCCON), 0
#define SE0                              BANKMASK(LCDSE0), 0
#define SE1                              BANKMASK(LCDSE0), 1
#define SE10                             BANKMASK(LCDSE1), 2
#define SE11                             BANKMASK(LCDSE1), 3
#define SE12                             BANKMASK(LCDSE1), 4
#define SE13                             BANKMASK(LCDSE1), 5
#define SE14                             BANKMASK(LCDSE1), 6
#define SE15                             BANKMASK(LCDSE1), 7
#define SE16                             BANKMASK(LCDSE2), 0
#define SE17                             BANKMASK(LCDSE2), 1
#define SE18                             BANKMASK(LCDSE2), 2
#define SE19                             BANKMASK(LCDSE2), 3
#define SE2                              BANKMASK(LCDSE0), 2
#define SE20                             BANKMASK(LCDSE2), 4
#define SE21                             BANKMASK(LCDSE2), 5
#define SE22                             BANKMASK(LCDSE2), 6
#define SE23                             BANKMASK(LCDSE2), 7
#define SE24                             BANKMASK(LCDSE3), 0
#define SE25                             BANKMASK(LCDSE3), 1
#define SE26                             BANKMASK(LCDSE3), 2
#define SE27                             BANKMASK(LCDSE3), 3
#define SE28                             BANKMASK(LCDSE3), 4
#define SE29                             BANKMASK(LCDSE3), 5
#define SE3                              BANKMASK(LCDSE0), 3
#define SE30                             BANKMASK(LCDSE3), 6
#define SE31                             BANKMASK(LCDSE3), 7
#define SE32                             BANKMASK(LCDSE4), 0
#define SE33                             BANKMASK(LCDSE4), 1
#define SE34                             BANKMASK(LCDSE4), 2
#define SE35                             BANKMASK(LCDSE4), 3
#define SE36                             BANKMASK(LCDSE4), 4
#define SE37                             BANKMASK(LCDSE4), 5
#define SE38                             BANKMASK(LCDSE4), 6
#define SE39                             BANKMASK(LCDSE4), 7
#define SE4                              BANKMASK(LCDSE0), 4
#define SE40                             BANKMASK(LCDSE5), 0
#define SE41                             BANKMASK(LCDSE5), 1
#define SE5                              BANKMASK(LCDSE0), 5
#define SE6                              BANKMASK(LCDSE0), 6
#define SE7                              BANKMASK(LCDSE0), 7
#define SE8                              BANKMASK(LCDSE1), 0
#define SE9                              BANKMASK(LCDSE1), 1
#define SEG0COM0                         BANKMASK(LCDDATA0), 0
#define SEG0COM1                         BANKMASK(LCDDATA3), 0
#define SEG0COM2                         BANKMASK(LCDDATA6), 0
#define SEG0COM3                         BANKMASK(LCDDATA9), 0
#define SEG10COM0                        BANKMASK(LCDDATA1), 2
#define SEG10COM1                        BANKMASK(LCDDATA4), 2
#define SEG10COM2                        BANKMASK(LCDDATA7), 2
#define SEG10COM3                        BANKMASK(LCDDATA10), 2
#define SEG11COM0                        BANKMASK(LCDDATA1), 3
#define SEG11COM1                        BANKMASK(LCDDATA4), 3
#define SEG11COM2                        BANKMASK(LCDDATA7), 3
#define SEG11COM3                        BANKMASK(LCDDATA10), 3
#define SEG12COM0                        BANKMASK(LCDDATA1), 4
#define SEG12COM1                        BANKMASK(LCDDATA4), 4
#define SEG12COM2                        BANKMASK(LCDDATA7), 4
#define SEG12COM3                        BANKMASK(LCDDATA10), 4
#define SEG13COM0                        BANKMASK(LCDDATA1), 5
#define SEG13COM1                        BANKMASK(LCDDATA4), 5
#define SEG13COM2                        BANKMASK(LCDDATA7), 5
#define SEG13COM3                        BANKMASK(LCDDATA10), 5
#define SEG14COM0                        BANKMASK(LCDDATA1), 6
#define SEG14COM1                        BANKMASK(LCDDATA4), 6
#define SEG14COM2                        BANKMASK(LCDDATA7), 6
#define SEG14COM3                        BANKMASK(LCDDATA10), 6
#define SEG15COM0                        BANKMASK(LCDDATA1), 7
#define SEG15COM1                        BANKMASK(LCDDATA4), 7
#define SEG15COM2                        BANKMASK(LCDDATA7), 7
#define SEG15COM3                        BANKMASK(LCDDATA10), 7
#define SEG16COM0                        BANKMASK(LCDDATA2), 0
#define SEG16COM1                        BANKMASK(LCDDATA5), 0
#define SEG16COM2                        BANKMASK(LCDDATA8), 0
#define SEG16COM3                        BANKMASK(LCDDATA11), 0
#define SEG17COM0                        BANKMASK(LCDDATA2), 1
#define SEG17COM1                        BANKMASK(LCDDATA5), 1
#define SEG17COM2                        BANKMASK(LCDDATA8), 1
#define SEG17COM3                        BANKMASK(LCDDATA11), 1
#define SEG18COM0                        BANKMASK(LCDDATA2), 2
#define SEG18COM1                        BANKMASK(LCDDATA5), 2
#define SEG18COM2                        BANKMASK(LCDDATA8), 2
#define SEG18COM3                        BANKMASK(LCDDATA11), 2
#define SEG19COM0                        BANKMASK(LCDDATA2), 3
#define SEG19COM1                        BANKMASK(LCDDATA5), 3
#define SEG19COM2                        BANKMASK(LCDDATA8), 3
#define SEG19COM3                        BANKMASK(LCDDATA11), 3
#define SEG1COM0                         BANKMASK(LCDDATA0), 1
#define SEG1COM1                         BANKMASK(LCDDATA3), 1
#define SEG1COM2                         BANKMASK(LCDDATA6), 1
#define SEG1COM3                         BANKMASK(LCDDATA9), 1
#define SEG20COM0                        BANKMASK(LCDDATA2), 4
#define SEG20COM1                        BANKMASK(LCDDATA5), 4
#define SEG20COM2                        BANKMASK(LCDDATA8), 4
#define SEG20COM3                        BANKMASK(LCDDATA11), 4
#define SEG21COM0                        BANKMASK(LCDDATA2), 5
#define SEG21COM1                        BANKMASK(LCDDATA5), 5
#define SEG21COM2                        BANKMASK(LCDDATA8), 5
#define SEG21COM3                        BANKMASK(LCDDATA11), 5
#define SEG22COM0                        BANKMASK(LCDDATA2), 6
#define SEG22COM1                        BANKMASK(LCDDATA5), 6
#define SEG22COM2                        BANKMASK(LCDDATA8), 6
#define SEG22COM3                        BANKMASK(LCDDATA11), 6
#define SEG23COM0                        BANKMASK(LCDDATA2), 7
#define SEG23COM1                        BANKMASK(LCDDATA5), 7
#define SEG23COM2                        BANKMASK(LCDDATA8), 7
#define SEG23COM3                        BANKMASK(LCDDATA11), 7
#define SEG24COM0                        BANKMASK(LCDDATA12), 0
#define SEG24COM1                        BANKMASK(LCDDATA15), 0
#define SEG24COM2                        BANKMASK(LCDDATA18), 0
#define SEG24COM3                        BANKMASK(LCDDATA21), 0
#define SEG25COM0                        BANKMASK(LCDDATA12), 1
#define SEG25COM1                        BANKMASK(LCDDATA15), 1
#define SEG25COM2                        BANKMASK(LCDDATA18), 1
#define SEG25COM3                        BANKMASK(LCDDATA21), 1
#define SEG26COM0                        BANKMASK(LCDDATA12), 2
#define SEG26COM1                        BANKMASK(LCDDATA15), 2
#define SEG26COM2                        BANKMASK(LCDDATA18), 2
#define SEG26COM3                        BANKMASK(LCDDATA21), 2
#define SEG27COM0                        BANKMASK(LCDDATA12), 3
#define SEG27COM1                        BANKMASK(LCDDATA15), 3
#define SEG27COM2                        BANKMASK(LCDDATA18), 3
#define SEG27COM3                        BANKMASK(LCDDATA21), 3
#define SEG28COM0                        BANKMASK(LCDDATA12), 4
#define SEG28COM1                        BANKMASK(LCDDATA15), 4
#define SEG28COM2                        BANKMASK(LCDDATA18), 4
#define SEG28COM3                        BANKMASK(LCDDATA21), 4
#define SEG29COM0                        BANKMASK(LCDDATA12), 5
#define SEG29COM1                        BANKMASK(LCDDATA15), 5
#define SEG29COM2                        BANKMASK(LCDDATA18), 5
#define SEG29COM3                        BANKMASK(LCDDATA21), 5
#define SEG2COM0                         BANKMASK(LCDDATA0), 2
#define SEG2COM1                         BANKMASK(LCDDATA3), 2
#define SEG2COM2                         BANKMASK(LCDDATA6), 2
#define SEG2COM3                         BANKMASK(LCDDATA9), 2
#define SEG30COM0                        BANKMASK(LCDDATA12), 6
#define SEG30COM1                        BANKMASK(LCDDATA15), 6
#define SEG30COM2                        BANKMASK(LCDDATA18), 6
#define SEG30COM3                        BANKMASK(LCDDATA21), 6
#define SEG31COM0                        BANKMASK(LCDDATA12), 7
#define SEG31COM1                        BANKMASK(LCDDATA15), 7
#define SEG31COM2                        BANKMASK(LCDDATA18), 7
#define SEG31COM3                        BANKMASK(LCDDATA21), 7
#define SEG32COM0                        BANKMASK(LCDDATA13), 0
#define SEG32COM1                        BANKMASK(LCDDATA16), 0
#define SEG32COM2                        BANKMASK(LCDDATA19), 0
#define SEG32COM3                        BANKMASK(LCDDATA22), 0
#define SEG33COM0                        BANKMASK(LCDDATA13), 1
#define SEG33COM1                        BANKMASK(LCDDATA16), 1
#define SEG33COM2                        BANKMASK(LCDDATA19), 1
#define SEG33COM3                        BANKMASK(LCDDATA22), 1
#define SEG34COM0                        BANKMASK(LCDDATA13), 2
#define SEG34COM1                        BANKMASK(LCDDATA16), 2
#define SEG34COM2                        BANKMASK(LCDDATA19), 2
#define SEG34COM3                        BANKMASK(LCDDATA22), 2
#define SEG35COM0                        BANKMASK(LCDDATA13), 3
#define SEG35COM1                        BANKMASK(LCDDATA16), 3
#define SEG35COM2                        BANKMASK(LCDDATA19), 3
#define SEG35COM3                        BANKMASK(LCDDATA22), 3
#define SEG36COM0                        BANKMASK(LCDDATA13), 4
#define SEG36COM1                        BANKMASK(LCDDATA16), 4
#define SEG36COM2                        BANKMASK(LCDDATA19), 4
#define SEG36COM3                        BANKMASK(LCDDATA22), 4
#define SEG37COM0                        BANKMASK(LCDDATA13), 5
#define SEG37COM1                        BANKMASK(LCDDATA16), 5
#define SEG37COM2                        BANKMASK(LCDDATA19), 5
#define SEG37COM3                        BANKMASK(LCDDATA22), 5
#define SEG38COM0                        BANKMASK(LCDDATA13), 6
#define SEG38COM1                        BANKMASK(LCDDATA16), 6
#define SEG38COM2                        BANKMASK(LCDDATA19), 6
#define SEG38COM3                        BANKMASK(LCDDATA22), 6
#define SEG39COM0                        BANKMASK(LCDDATA13), 7
#define SEG39COM1                        BANKMASK(LCDDATA16), 7
#define SEG39COM2                        BANKMASK(LCDDATA19), 7
#define SEG39COM3                        BANKMASK(LCDDATA22), 7
#define SEG3COM0                         BANKMASK(LCDDATA0), 3
#define SEG3COM1                         BANKMASK(LCDDATA3), 3
#define SEG3COM2                         BANKMASK(LCDDATA6), 3
#define SEG3COM3                         BANKMASK(LCDDATA9), 3
#define SEG40COM0                        BANKMASK(LCDDATA14), 0
#define SEG40COM1                        BANKMASK(LCDDATA17), 0
#define SEG40COM2                        BANKMASK(LCDDATA20), 0
#define SEG40COM3                        BANKMASK(LCDDATA23), 0
#define SEG41COM0                        BANKMASK(LCDDATA14), 1
#define SEG41COM1                        BANKMASK(LCDDATA17), 1
#define SEG41COM2                        BANKMASK(LCDDATA20), 1
#define SEG41COM3                        BANKMASK(LCDDATA23), 1
#define SEG4COM0                         BANKMASK(LCDDATA0), 4
#define SEG4COM1                         BANKMASK(LCDDATA3), 4
#define SEG4COM2                         BANKMASK(LCDDATA6), 4
#define SEG4COM3                         BANKMASK(LCDDATA9), 4
#define SEG5COM0                         BANKMASK(LCDDATA0), 5
#define SEG5COM1                         BANKMASK(LCDDATA3), 5
#define SEG5COM2                         BANKMASK(LCDDATA6), 5
#define SEG5COM3                         BANKMASK(LCDDATA9), 5
#define SEG6COM0                         BANKMASK(LCDDATA0), 6
#define SEG6COM1                         BANKMASK(LCDDATA3), 6
#define SEG6COM2                         BANKMASK(LCDDATA6), 6
#define SEG6COM3                         BANKMASK(LCDDATA9), 6
#define SEG7COM0                         BANKMASK(LCDDATA0), 7
#define SEG7COM1                         BANKMASK(LCDDATA3), 7
#define SEG7COM2                         BANKMASK(LCDDATA6), 7
#define SEG7COM3                         BANKMASK(LCDDATA9), 7
#define SEG8COM0                         BANKMASK(LCDDATA1), 0
#define SEG8COM1                         BANKMASK(LCDDATA4), 0
#define SEG8COM2                         BANKMASK(LCDDATA7), 0
#define SEG8COM3                         BANKMASK(LCDDATA10), 0
#define SEG9COM0                         BANKMASK(LCDDATA1), 1
#define SEG9COM1                         BANKMASK(LCDDATA4), 1
#define SEG9COM2                         BANKMASK(LCDDATA7), 1
#define SEG9COM3                         BANKMASK(LCDDATA10), 1
#define SEGEN0                           BANKMASK(LCDSE0), 0
#define SEGEN1                           BANKMASK(LCDSE0), 1
#define SEGEN10                          BANKMASK(LCDSE1), 2
#define SEGEN11                          BANKMASK(LCDSE1), 3
#define SEGEN12                          BANKMASK(LCDSE1), 4
#define SEGEN13                          BANKMASK(LCDSE1), 5
#define SEGEN14                          BANKMASK(LCDSE1), 6
#define SEGEN15                          BANKMASK(LCDSE1), 7
#define SEGEN16                          BANKMASK(LCDSE2), 0
#define SEGEN17                          BANKMASK(LCDSE2), 1
#define SEGEN18                          BANKMASK(LCDSE2), 2
#define SEGEN19                          BANKMASK(LCDSE2), 3
#define SEGEN2                           BANKMASK(LCDSE0), 2
#define SEGEN20                          BANKMASK(LCDSE2), 4
#define SEGEN21                          BANKMASK(LCDSE2), 5
#define SEGEN22                          BANKMASK(LCDSE2), 6
#define SEGEN23                          BANKMASK(LCDSE2), 7
#define SEGEN24                          BANKMASK(LCDSE3), 0
#define SEGEN25                          BANKMASK(LCDSE3), 1
#define SEGEN26                          BANKMASK(LCDSE3), 2
#define SEGEN27                          BANKMASK(LCDSE3), 3
#define SEGEN28                          BANKMASK(LCDSE3), 4
#define SEGEN29                          BANKMASK(LCDSE3), 5
#define SEGEN3                           BANKMASK(LCDSE0), 3
#define SEGEN30                          BANKMASK(LCDSE3), 6
#define SEGEN31                          BANKMASK(LCDSE3), 7
#define SEGEN32                          BANKMASK(LCDSE4), 0
#define SEGEN33                          BANKMASK(LCDSE4), 1
#define SEGEN34                          BANKMASK(LCDSE4), 2
#define SEGEN35                          BANKMASK(LCDSE4), 3
#define SEGEN36                          BANKMASK(LCDSE4), 4
#define SEGEN37                          BANKMASK(LCDSE4), 5
#define SEGEN38                          BANKMASK(LCDSE4), 6
#define SEGEN39                          BANKMASK(LCDSE4), 7
#define SEGEN4                           BANKMASK(LCDSE0), 4
#define SEGEN40                          BANKMASK(LCDSE5), 0
#define SEGEN41                          BANKMASK(LCDSE5), 1
#define SEGEN5                           BANKMASK(LCDSE0), 5
#define SEGEN6                           BANKMASK(LCDSE0), 6
#define SEGEN7                           BANKMASK(LCDSE0), 7
#define SEGEN8                           BANKMASK(LCDSE1), 0
#define SEGEN9                           BANKMASK(LCDSE1), 1
#define SLPEN                            BANKMASK(LCDCON), 6
#define SMP                              BANKMASK(SSPSTAT), 7
#define SPEN                             BANKMASK(RCSTA), 7
#define SREN                             BANKMASK(RCSTA), 5
#define SSPEN                            BANKMASK(SSPCON), 5
#define SSPIE                            BANKMASK(PIE1), 3
#define SSPIF                            BANKMASK(PIR1), 3
#define SSPM0                            BANKMASK(SSPCON), 0
#define SSPM1                            BANKMASK(SSPCON), 1
#define SSPM2                            BANKMASK(SSPCON), 2
#define SSPM3                            BANKMASK(SSPCON), 3
#define SSPOV                            BANKMASK(SSPCON), 6
#define SWDTE                            BANKMASK(WDTCON), 0
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC                             BANKMASK(TXSTA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GE                             BANKMASK(T1CON), 6
#define T1GINV                           BANKMASK(T1CON), 7
#define T1GSS                            BANKMASK(CMCON1), 1
#define T1INSYNC                         BANKMASK(T1CON), 2
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T1SYNC                           BANKMASK(T1CON), 2
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR1CS                           BANKMASK(T1CON), 1
#define TMR1GE                           BANKMASK(T1CON), 6
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TOUTPS0                          BANKMASK(T2CON), 3
#define TOUTPS1                          BANKMASK(T2CON), 4
#define TOUTPS2                          BANKMASK(T2CON), 5
#define TOUTPS3                          BANKMASK(T2CON), 6
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISA6                           BANKMASK(TRISA), 6
#define TRISA7                           BANKMASK(TRISA), 7
#define TRISB0                           BANKMASK(TRISB), 0
#define TRISB1                           BANKMASK(TRISB), 1
#define TRISB2                           BANKMASK(TRISB), 2
#define TRISB3                           BANKMASK(TRISB), 3
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TRISD0                           BANKMASK(TRISD), 0
#define TRISD1                           BANKMASK(TRISD), 1
#define TRISD2                           BANKMASK(TRISD), 2
#define TRISD3                           BANKMASK(TRISD), 3
#define TRISD4                           BANKMASK(TRISD), 4
#define TRISD5                           BANKMASK(TRISD), 5
#define TRISD6                           BANKMASK(TRISD), 6
#define TRISD7                           BANKMASK(TRISD), 7
#define TRISE0                           BANKMASK(TRISE), 0
#define TRISE1                           BANKMASK(TRISE), 1
#define TRISE2                           BANKMASK(TRISE), 2
#define TRISE3                           BANKMASK(TRISE), 3
#define TRISE4                           BANKMASK(TRISE), 4
#define TRISE5                           BANKMASK(TRISE), 5
#define TRISE6                           BANKMASK(TRISE), 6
#define TRISE7                           BANKMASK(TRISE), 7
#define TRISF0                           BANKMASK(TRISF), 0
#define TRISF1                           BANKMASK(TRISF), 1
#define TRISF2                           BANKMASK(TRISF), 2
#define TRISF3                           BANKMASK(TRISF), 3
#define TRISF4                           BANKMASK(TRISF), 4
#define TRISF5                           BANKMASK(TRISF), 5
#define TRISF6                           BANKMASK(TRISF), 6
#define TRISF7                           BANKMASK(TRISF), 7
#define TRISG0                           BANKMASK(TRISG), 0
#define TRISG1                           BANKMASK(TRISG), 1
#define TRISG2                           BANKMASK(TRISG), 2
#define TRISG3                           BANKMASK(TRISG), 3
#define TRISG4                           BANKMASK(TRISG), 4
#define TRISG5                           BANKMASK(TRISG), 5
#define TRMT                             BANKMASK(TXSTA), 1
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TX8_9                            BANKMASK(TXSTA), 6
#define TX9                              BANKMASK(TXSTA), 6
#define TX9D                             BANKMASK(TXSTA), 0
#define TXD8                             BANKMASK(TXSTA), 0
#define TXEN                             BANKMASK(TXSTA), 5
#define TXIE                             BANKMASK(PIE1), 4
#define TXIF                             BANKMASK(PIR1), 4
#define UA                               BANKMASK(SSPSTAT), 1
#define VCFG0                            BANKMASK(ADCON0), 5
#define VCFG1                            BANKMASK(ADCON0), 6
#define VLCDEN                           BANKMASK(LCDCON), 4
#define VR0                              BANKMASK(VRCON), 0
#define VR1                              BANKMASK(VRCON), 1
#define VR2                              BANKMASK(VRCON), 2
#define VR3                              BANKMASK(VRCON), 3
#define VREN                             BANKMASK(VRCON), 7
#define VRR                              BANKMASK(VRCON), 5
#define WA                               BANKMASK(LCDPS), 4
#define WCOL                             BANKMASK(SSPCON), 7
#define WDTPS0                           BANKMASK(WDTCON), 1
#define WDTPS1                           BANKMASK(WDTCON), 2
#define WDTPS2                           BANKMASK(WDTCON), 3
#define WDTPS3                           BANKMASK(WDTCON), 4
#define WERR                             BANKMASK(LCDCON), 5
#define WFT                              BANKMASK(LCDPS), 7
